***messages***

:STRINGS

IDS_OK                         "Đồng ý"
IDS_WARNING                    "Cảnh báo"
IDS_ERROR                      "Lỗi"
IDS_DRIVENOTACCESSIBLE         "Ổ đĩa %c: không thể truy cập"
IDS_PSWNOTMATCH                "Sai mật khẩu."
IDS_FILETYPE                   "Tập tin %s"
IDS_REGONLY                    "Chỉ có trong phiên bản đã đăng ký."
IDS_ARCHIVE                    "Tập tin nén"
IDS_PATHNOTACCESSIBLE          "Đường dẫn \"%s\" không thể truy cập"
IDS_KEYADD                     "Thêm"
IDS_KEYVIEW                    "Xem"
IDS_KEYDELETE                  "Xóa"
IDS_KEYREPAIR                  "Sửa chữa"
IDS_KEYEXTRACT                 "Giải nén"
IDS_KEYEXTRACTTO               "Giải nén đến"
IDS_KEYTEST                    "Kiểm tra"
IDS_KEYCOMMENT                 "Chú thích"
IDS_KEYPROTECT                 "Bảo vệ"
IDS_KEYLOCK                    "Khóa"
IDS_KEYSFX                     "SFX"
IDS_KEYINFO                    "Thông tin"
IDS_KEYWIZARD                  "Trình thuật sĩ"
IDS_KEYEXIT                    "Thoát"
IDS_KEYFIND                    "Tìm"
IDS_KEYCONVERT                 "Chuyển đổi"
IDS_KEYVIR                     "Quét Virut"
IDS_KEYREPORT                  "Báo cáo"
IDS_KEYBENCH                   "Đánh giá"
IDS_KEYPRINT                   "In"
IDS_COLUMNTITLENAME            "Tên"
IDS_COLUMNTITLESIZE            "Kích thước"
IDS_COLUMNTITLETYPE            "Loại"
IDS_COLUMNTITLEPACKED          "Đã nén"
IDS_COLUMNTITLEMODIFIED        "Chỉnh sửa"
IDS_COLUMNTITLECREATED         "Tạo"
IDS_COLUMNTITLEACCESSED        "Đã truy cập"
IDS_COLUMNTITLEATTR            "Thuộc tính"
IDS_COLUMNTITLECRC             "CRC32"
IDS_COLUMNTITLECRC16           "CRC16"
IDS_COLUMNTITLEBLAKE2          "Tổng kiểm tra BLAKE2"
IDS_COLUMNTITLECHECKSUM        "Tổng kiểm tra"
IDS_COLUMNTITLEPATH            "Đường dẫn"
IDS_TIPFADD                    "Thêm các tập tin vào tập tin nén"
IDS_TIPFVIEW                   "Xem tập tin"
IDS_TIPFDELETE                 "Xóa các tập tin"
IDS_TIPFREPAIR                 "Sửa tập tin nén bị hư"
IDS_TIPAEXTR                   "Giải nén không cần xác nhận"
IDS_TIPAEXTRTO                 "Giải nén các tập tin"
IDS_TIPATEST                   "Kiểm tra các tập tin đã nén"
IDS_TIPAVIEW                   "Xem tập tin đã nén"
IDS_TIPADELETE                 "Xóa các tập tin khỏi tập tin nén"
IDS_TIPACOMMENT                "Thêm chú thích tập tin nén"
IDS_TIPAPROTECT                "Bảo vệ tập tin nén khỏi hư hại"
IDS_TIPALOCK                   "Ngăn ngừa những sự sửa đổi tập tin nén"
IDS_TIPASFX                    "Chuyển đổi tập tin nén thành tự-giải nén"
IDS_TIPAINFO                   "Hiển thị thông tin"
IDS_TIPWIZARD                  "Giao diện trình thuật sĩ cho những người sử dụng cơ bản"
IDS_TIPEXIT                    "Đóng WinRAR"
IDS_TIPFIND                    "Tìm các tập tin và tập tin nén"
IDS_TIPCONVERT                 "Chuyển đổi các tập tin nén sang định dạng khác"
IDS_TIPVIRUS                   "Quét virut cho tập tin nén"
IDS_TIPREPORT                  "Phát sinh báo cáo"
IDS_TIPBENCH                   "Đánh giá tốc độ nén"
IDS_TIPPRINT                   "In tập tin"
IDS_TIPUP                      "Lên một mức"
IDS_METHOD0                    "Lưu trữ"
IDS_METHOD1                    "Nhanh nhất"
IDS_METHOD2                    "Nhanh"
IDS_METHOD3                    "Bình thường"
IDS_METHOD4                    "Tốt"
IDS_METHOD5                    "Tốt nhất"
IDS_VOLAUTO                    "Tự động phát hiện"
IDS_ASKNAME                    "Tìm tập tin nén"
IDS_ADDREPLACE                 "Thêm và thay thế các tập tin"
IDS_UPDATE                     "Thêm và cập nhật các tập tin"
IDS_FRESH                      "Chỉ làm mới các tập tin đã có"
IDS_SYNCHRONIZE                "Đồng bộ hóa nội dung tập tin nén"
IDS_ASKOVERWRITE               "Hỏi trước khi ghi đè"
IDS_SKIPEXISTING               "Bỏ qua các tập tin đã có"
IDS_ARCUSEPASSWORD             "Nén với mật khẩu"
IDS_TREETITLE                  "Chọn thư mục mới"
IDS_NOFILESSELECTED            "Chưa chọn tập tin nào. Bạn cần chọn các tập tin để thêm vào"
IDS_NOFILESSELCOMMON           "Chưa chọn tập tin nào. Bạn cần chọn các tập tin cho thao tác này"
IDS_NOFILEDIRSELCOMMON         "Chưa có tệp hoặc thư mục nào được chọn. Bạn phải chọn chúng cho hoạt động này"
IDS_PATHNOTEXIST               "Đường dẫn không tồn tại. Tạo nó?"
IDS_VIEWTITLE                  "Xem"
IDS_BYTES                      "bytes"
IDS_DOSTEXT                    "Văn bản DOS"
IDS_ANSITEXT                   "Văn bản Windows"
IDS_UTF16LETEXT                "Unicode (UTF-16LE)"
IDS_UTF8TEXT                   "Unicode (UTF-8)"
IDS_VIEWMENUCOPY               "&Sao chép"
IDS_VIEWMENUSELECTALL          "Chọ&n Tất cả"
IDS_VIEWMENUWIN                "Xem dạng văn bản &Windows"
IDS_VIEWMENUDOS                "Xem dạng văn bản &DOS"
IDS_VIEWMENUUTF16LE            "Xem dạng &Unicode (UTF-16LE)"
IDS_VIEWMENUUTF8               "Xem dạng Unicode (UTF-&8)"
IDS_VIEWMENUWORDWRAP           "C&uộn Dòng"
IDS_VIEWMENUFIND               "&Tìm"
IDS_VIEWMENUFINDNEXT           "Tì&m Tiếp"
IDS_VIEWMENUCLOSE              "Đón&g"
IDS_CANNOTFIND                 "Không thể tìm"
IDS_NOTFOUND                   "Chuỗi không tìm thấy"
IDS_ASKDESTPATH                "Giải nén Đến..."
IDS_SELECTED                   "Đã chọn"
IDS_BYTESINFILE                "%s byte trong %d tập tin"
IDS_BYTESINFILES               "%s byte trong %d tập tin"

; These two are for messages like "Selected 15 MB in 5 files".
; WinRAR replaces "%s" with size with unit included.
IDS_UNITSINFILE                "%s trong %d tệp"
IDS_UNITSINFILES               "%s trong %d tệp"

IDS_AND                        "và"
IDS_BYTESINDIRECTORY           "thư mục"
IDS_BYTESINDIRECTORIES         "thư mục"
IDS_TOTAL                      "Tổng cộng"
IDS_READINGFOLDER              "Đang đọc thư mục"
IDS_READINGARCHIVE             "Đang đọc thư mục: %d tập tin đã đọc"
IDS_READINGARCHIVEFOLDER       "Đang đọc thư mục tập tin nén"
IDS_FILEOUTMEM                 "Không đủ bộ nhớ để xử lý tất cả các tập tin"
IDS_CANNOTOPEN                 "Không thể mở %s"
IDS_CANNOTCREATE               "Không thể tạo %s"
IDS_CANNOTMKDIR                "Không thể tạo thư mục %s"
IDS_ENCRCRCFAILED              "Lỗi tổng kiểm tra trong tập tin đã mã hóa %s. Tập tin hỏng hoặc sai mật khẩu."
IDS_EXTRCRCFAILED              "Lỗi tổng kiểm tra trong %s. Tập tin bị hỏng"
IDS_PACKEDDATACRCFAILED        "Lỗi tổng kiểm tra dữ liệu đã nén trong %s. Phần bị hỏng"
IDS_BADARCHIVE                 "Tập tin nén hoặc là định dạng chưa biết hoặc đã bị hỏng"
IDS_CANNOTADDTOEXT             "WinRAR chỉ có thể thêm các tập tin vào các tập tin nén RAR hoặc ZIP"
IDS_NONZEROCODE                "Trình nén trả về mã thoát %d"
IDS_OUTOFMEMORYERROR           "Không đủ bộ nhớ"
IDS_WRITEERROR                 "Lỗi ghi trong tập tin %s. Có thể đĩa đã đầy"
IDS_CANNOTEXECUTE              "Không thể thực thi \"%s\""
IDS_CANNOTDELETE               "Không thể xóa %s"
IDS_RECYCLEFAILED              "Không thể di chuyển tệp và thư mục vào thùng rác"
IDS_CANNOTRECYCLE              "Không thể di chuyển %s vào Thùng Rác"
IDS_CANNOTRECYCLEHINT          "Sử dụng Shift+Del để xóa nó vĩnh viễn"
IDS_READERROR                  "Lỗi đọc trong tập tin %s"
IDS_SEEKERROR                  "Lỗi tìm kiếm trong tập tin %s"
IDS_CLOSEERROR                 "Không thể đóng tập tin %s"
IDS_CANNOTFINDFILE             "Không thể tìm %s"
IDS_CANNOTRENAME               "Không thể đổi tên %s thành %s"
IDS_CREATINGARCHIVE            "Đang tạo tập tin nén %s"
IDS_UPDATINGARCHIVE            "Đang cập nhật tập tin nén %s"
IDS_EXTRACTING                 "Đang giải nén từ %s"
IDS_TESTING                    "Đang kiểm tra %s"
IDS_REPAIRING                  "Đang sửa %s"
IDS_DELETING                   "Đang xóa khỏi %s"
IDS_COMMENTING                 "Đang thêm chú thích tập tin nén"
IDS_CONVERTING                 "Đang chuyển đổi sang SFX"
IDS_REMOVESFX                  "Đang loại bỏ module SFX"
IDS_PROCESSARC                 "Đang xử lý tập tin nén %s"
IDS_LOCKING                    "Đang khóa tập tin nén"
IDS_ADDRECREC                  "Đang thêm bản ghi phục hồi"
IDS_ADDING                     "đang thêm"
IDS_UPDATING                   "đang cập nhật"
IDS_ANALYZING                  "đang phân tích"
IDS_REPACKING                  "đang nén lại"
IDS_PREPARING                  "chuẩn bị"
IDS_CMDTESTING                 "đang kiểm tra"
IDS_CMDEXTRACTING              "đang giải nén"
IDS_SKIPPING                   "đang bỏ qua"
IDS_SCANNING                   "Đang tìm kiếm các tập tin nén..."
IDS_MESSAGE                    "Thông báo"
IDS_DELETETITLE                "Xóa"
IDS_ASKDELETE                  "Bạn có chắc bạn muốn xóa"
IDS_DIRECTORY                  "thư mục"
IDS_DIRECTORIES                "thư mục"
IDS_FILE                       "tập tin"
IDS_FILES                      "tập tin"
IDS_DELETINGFILE               "Đang xóa %s"
IDS_REPACKINGFILE              "Đang nén lại %s"
IDS_COPYINGFILE                "Đang sao chép %s"
IDS_REPAIRTITLE                "Sửa chữa"
IDS_REPAIRDETECTING            "Đang phát hiện loại tập tin nén..."
IDS_REPAIREXT                  "WinRAR chỉ có thể sửa chữa các tập tin nén RAR và ZIP"
IDS_BUILD                      "Xây dựng %s"
IDS_FOUND                      "Tìm thấy %s"
IDS_RRSEARCH                   "Đang tìm kiếm bản ghi phục hồi"
IDS_ANALYZEFILEDATA            "Phân tích dữ liệu tệp"
IDS_RRFOUND                    "---> tìm thấy bản ghi phục hồi"
IDS_RRNOTFOUND                 "---> không tìm thấy bản ghi phục hồi"
IDS_SECDAMAGED                 "Sector %ld (offsets %lX...%lX) bị hỏng"
IDS_SECRECOVERED               "---> sector đã phục hồi"
IDS_SECNOTRECOVERED            "---> không thể phục hồi sector"
IDS_REPAIRDONE                 "Hoàn tất"
IDS_REPAIRCLOSE                "Đóng"
IDS_REPAIRABORTED              "Đã hủy"
IDS_CANNOTREPAIROLD            "Không thể sửa chữa tập tin nén định dạng cũ"
IDS_ASKMARKSOLID               "Đầu mục tập tin nén bị hỏng. Đánh dấu tập tin nén là đặc?"
IDS_NOFILESREPAIRED            "Không có tập tin nào được sửa chữa"
IDS_ASKRECONSTRUCT             "Xây dựng lại cấu trúc tập tin nén"
IDS_ARCINFOTITLE               "Tập tin nén %s"
IDS_INFOSOLID                  "đặc"
IDS_INFOSFX                    "SFX"
IDS_INFOVOLUME                 "%s phần"
IDS_INFOARCHIVE                "Tập tin nén %s"
IDS_UNKNOWN                    "Không rõ"
IDS_PRESENT                    "Có mặt"
IDS_ABSENT                     "Vắng mặt"

; Displayed in "Info" dialog for archives with encrypted file names.
; Try to keep it short, this field is limited in space.
IDS_INFOENCNAMES               "Tên và nội dung"

IDS_UNEXPEOF                   "Kết thúc tập tin nén bất ngờ"
IDS_FILEHEADERBROKEN           "Tiêu đề lỗi: %s"
IDS_HEADERBROKEN               "Tìm thấy đầu mục bị hỏng"
IDS_MAINHEADERBROKEN           "Tiêu đề tập tin nén chính bị hỏng"
IDS_ARCBROKEN                  "Tập tin nén bị hỏng"
IDS_CANNOTFINDVOL              "Phần yêu cầu bị thiếu"
IDS_CMTBROKEN                  "Chú thích tập tin nén bị hỏng"
IDS_LOCKRARONLY                "Khóa chỉ hỗ trợ cho các tập tin nén RAR"
IDS_PROTECTRARONLY             "Bảo vệ chỉ hỗ trọ cho các tập tin nén RAR"
IDS_NOZIPVOL                   "Các tập tin nén ZIP nhiều phần chưa hỗ trợ"
IDS_BROKENORVOLZIP             "Tập tin nén ZIP hoặc nhiều phần hoặc bị hỏng"
IDS_LOGTITLE                   "Xem nhật ký"
IDS_LOGEMPTY                   "Nhật ký trống"
IDS_CANNOTMODIFYOLD            "Không thể chỉnh sửa tập tin nén (RAR 1.40) định dạng cũ"
IDS_CANNOTMODIFYLOCKED         "Không thể chỉnh sửa tập tin nén đã khóa"
IDS_CANNOTMODIFYVOLUME         "Không thể chỉnh sửa phần"
IDS_CANNOTMODIFYUNKNOWN        "Phương pháp chưa biết trong %s. Thao tác bị hủy"

; These SFX names must match actual SFX module file names in installation
; package. Normally they should not be changed.
IDS_DEFAULTSFXNAME32           "Default32.SFX"
IDS_WINCONSFXNAME32            "WinCon32.SFX"
IDS_ZIPSFXNAME32               "Zip32.SFX"
IDS_DEFAULTSFXNAME64           "Default64.SFX"
IDS_WINCONSFXNAME64            "WinCon64.SFX"
IDS_ZIPSFXNAME64               "Zip64.SFX"

; Edit these "dummy..." SFX names only if you added a new SFX module.
; Otherwise keep them as is.
IDS_DUMMYSFXNAME1              "dummysfxname1"
IDS_DUMMYSFXNAME2              "dummysfxname2"
IDS_DUMMYSFXNAME3              "dummysfxname3"
IDS_DUMMYSFXNAME4              "dummysfxname4"
IDS_DUMMYSFXNAME5              "dummysfxname5"
IDS_DUMMYSFXNAME6              "dummysfxname6"
IDS_DUMMYSFXNAME7              "dummysfxname7"
IDS_DUMMYSFXNAME8              "dummysfxname8"

; Descriptions of SFX modules. Unlike SFX names, they should be translated.
IDS_DEFAULTSFX32               "Windows 32-bit GUI RAR SFX"
IDS_WINCONSFX32                "Windows 32-bit console RAR SFX"
IDS_ZIPSFX32                   "Windows 32-bit GUI ZIP SFX"
IDS_DEFAULTSFX64               "Windows x64 GUI RAR SFX"
IDS_WINCONSFX64                "Windows x64 console RAR SFX"
IDS_ZIPSFX64                   "Windows x64 GUI ZIP SFX"

; Edit these "dummy..." SFX descriptions only if you added a new SFX module.
; Otherwise keep them as is.
IDS_DUMMYSFX1                  "dummysfxdescription1"
IDS_DUMMYSFX2                  "dummysfxdescription2"
IDS_DUMMYSFX3                  "dummysfxdescription3"
IDS_DUMMYSFX4                  "dummysfxdescription4"
IDS_DUMMYSFX5                  "dummysfxdescription5"
IDS_DUMMYSFX6                  "dummysfxdescription6"
IDS_DUMMYSFX7                  "dummysfxdescription7"
IDS_DUMMYSFX8                  "dummysfxdescription8"

IDS_SFXMODULE                  "Module"
IDS_SFXMODULEDIZ               "Mô tả"
IDS_NOTSFX                     "Đây không phải là tập tin nén SFX"
IDS_NOTFIRSTVOL                "Đây không phải là phần đầu tiên"
IDS_CANNOTTOSFXOLD             "Không thể chuyển đổi tập tin nén (RAR 1.5) định dạng cũ"
IDS_SETTINGS                   "Cài đặt"
IDS_PERCENTSDONE               "%d%% hoàn tất"
IDS_TRAYRESTORE                "Phục hồi"
IDS_TRAYBREAK                  "Ngắt thao tác"
IDS_TRAYPAUSE                  "Tạm dừng"
IDS_TRAYCONTINUE               "Tiếp tục"
IDS_SELECTADDFOLDER            "Chọn thư mục mặc định cho các tập tin nén"
IDS_SELECTEXTRFOLDER           "Chọn thư mục mặc định cho các tập tin đã giải nén"
IDS_SELECTTEMPFOLDER           "Chọn thư mục tạm"
IDS_SELECTSTARTFOLDER          "Chọn thư mục khởi động"
IDS_SELECTEXTVIEWER            "Chọn trình xem bên ngoài"
IDS_FILEWASMODIFIED            "Tập tin \"%s\" đã sửa đổi.\nBạn có muốn cập nhật nó trong tập tin nén?"
IDS_ASKABORT                   "Bạn có muốn hủy bỏ thao tác hiện tại?"
IDS_ASKABORTTITLE              "Người dùng ngắt"
IDS_MENUMKDIR                  "Tạo một thư mục &mới"
IDS_MENURENAME                 "Đổ&i tên"
IDS_MENUPRINT                  "&In tập tin"
IDS_MENULISTVIEWMENU           "Xem &dạng"
IDS_MENULISTSORT               "Sắp xếp th&eo"
IDS_MENURUN                    "Thực thi"
IDS_MENUASSOCIATEDAPP          "Mở trong ứng dụng"
IDS_MENUSHOWCONTENTS           "Xem nội dung\tCtrl+PgDn"
IDS_MENUINTVIEWER              "Mở bằng trình xem\tCtrl+Q"
IDS_MENULISTVIEW               "&Danh sách"
IDS_MENUDETAILSVIEW            "&Chi tiết"
IDS_SORTNAME                   "&Tên"
IDS_SORTSIZE                   "&Kích thước"
IDS_SORTPACKEDSIZE             "Kích thước đã &nén"
IDS_SORTTYPE                   "&Loại"
IDS_SORTMODIFIED               "Thời gian c&hỉnh sửa"
IDS_SORTCREATED                "Thời gian tạ&o"
IDS_SORTACCESSED               "Thời gian truy cập &cuối cùng"
IDS_SORTATTR                   "Th&uộc tính"
IDS_SORTCRC                    "&Tổng kiểm tra"
IDS_SORTORIGINAL               "Thứ tự &gốc"
IDS_CLEARINGATTR               "Đang xóa thuộc tính \"Arc\""
IDS_ADDDELETE                  "Đang xóa"
IDS_NOFILESTOADD               "Không có tập tin nào để thêm"
IDS_ERASEDISK                  "Đang xóa đĩa %c:"
IDS_UNKNOWNMETHOD              "Phương pháp chưa biết trong %s"
IDS_NEWRARFORMAT               "Định dạng tập tin nén không được hỗ trợ. Xin hãy cập nhật WinRAR tới một phiên bản mới hơn."
IDS_NOFILESTOEXTRACT           "Không có tập tin nào để giải nén"
IDS_NOFILESTODELETE            "Không có tập tin nào để xóa"
IDS_DISKFULL                   "Đĩa đầy. Chèn cái tiếp theo."
IDS_DISKFULLTITLE              "Đĩa đầy"
IDS_PATHTOOLONG                "Đường dẫn quá dài"
IDS_JAN                        "Th1"
IDS_FEB                        "Th2"
IDS_MAR                        "Th3"
IDS_APR                        "Th4"
IDS_MAY                        "Th5"
IDS_JUN                        "Th6"
IDS_JUL                        "Th7"
IDS_AUG                        "Th8"
IDS_SEP                        "Th9"
IDS_OCT                        "Th10"
IDS_NOV                        "Th11"
IDS_DEC                        "Th12"
IDS_ARCFOUND                   "%d tập tin được tìm thấy"
IDS_ARCPROCESSED               "%d tập tin được tìm thấy, %d đã xử lý"
IDS_NOARCFOUND                 "Không tìm thấy tập tin nén nào trong các tập tin và thư mục đã chọn"
IDS_ARCFOUNDTITLE              "Thao tác nhóm tập tin nén"
IDS_REGFAILED                  "Đăng ký thất bại"
IDS_THANKS                     "Giấy phép WinRAR hợp lệ. Cảm ơn bạn!"
IDS_REGCORRECT                 "Đăng ký đúng"
IDS_EVALCOPY                   "phiên bản giới hạn"
IDS_EVALDAYSLEFT               "chỉ còn %d ngày còn lại để mua một giấy phép"
IDS_CMDNOARCFOUND              "Không tìm thấy tập tin nén nào"
IDS_UNKNOWNCOMMAND             "Lệnh chưa biết \"%s\""
IDS_UNKNOWNOPTION              "Tùy chọn chưa biết \"%s\""
IDS_SWSYNTAXERROR              "'-' được mong đợi ở đầu \"%s\""
IDS_FILESFOUND                 "%d tập tin được tìm thấy"
IDS_FILESMODIFIED              "Vài tập tin được giải nén từ %s đã sửa đổi hoặc những tập tin mới đã được tạo.\nBạn có muốn đặt chúng vào tập tin nén?"
IDS_EXECUTETITLE               "Thực thi"
IDS_WINRARHELP                 "Trợ giúp WinRAR"
IDS_RARHELP                    "Tài liệu RAR Console"
IDS_WHATSNEW                   "Có gì mới trong phiên bản mới nhất"

; Name of WhatsNew.txt file in distribution package.
; Edit it only if you renamed this file.
IDS_WHATSNEWNAME               "WhatsNew.txt"

IDS_MODIFIEDON                 "chỉnh sửa lúc"
IDS_TOOLBARSMALL               "Nhỏ"
IDS_TOOLBARMEDIUM              "Vừa"
IDS_TOOLBARLARGE               "Lớn"
IDS_TOOLBAREXTRALARGE          "Rất Lớn"
IDS_TOOLBARMENUTEXT            "Hiển thị văn bản"
IDS_TOOLBARMENULOCK            "Khóa thanh công cụ"
IDS_TOOLBARMENUSELTB           "Chọn thanh công cụ..."
IDS_TOOLBARMENUSELECT          "Chọn công cụ..."
IDS_TESTMSGTITLE               "Kiểm tra kết thúc"
IDS_TESTMSGTEXT                "Không tìm thấy lỗi nào trong khi thực hiện kiểm tra"
IDS_CMDNOTSUPPORTED            "Lệnh không hỗ trợ cho loại tập tin nén này"
IDS_FILERO                     "%s là chỉ-đọc"
IDS_REGISTEREDTO               "Đăng ký cho"
IDS_REGKEYWARNING              "kích thước đã giải nén %s byte"
IDS_ARCSIZE                    "kích thước không nén %s byte"
IDS_CLEARLOGTITLE              "Xóa nhật ký"
IDS_CLEARLOG                   "Bạn có chắc chắn muốn xóa tệp nhật ký không?"
IDS_WINRARARC                  "Tập tin nén WinRAR"
IDS_WINRARZIPARC               "Tập tin nén ZIP WinRAR"
IDS_NEWFOLDER                  "Thư mục Mới"
IDS_ENCRNOTSUPPORTED           "Tập tin đã mã hóa %s. Mã hóa chưa được hỗ trợ cho loại những tập tin nén này"
IDS_NOTSUPPORTED               "%s không được hỗ trợ"
IDS_ARCNAMEPARAM               "Tên và các tham số tập tin nén"
IDS_SELECTARCCOMMENT           "Chọn tập tin chú thích"
IDS_ACLGETERROR                "Không thể lấy dữ liệu bảo mật %s"
IDS_ACLSETERROR                "Không thể đặt dữ liệu bảo mật %s"
IDS_ACLBROKEN                  "Dữ liệu bảo mật %s bị hỏng\n"
IDS_ACLUNKNOWN                 "Định dạng chưa biết của dữ liệu bảo mật %s\n"
IDS_STREAMBROKEN               "Dữ liệu dòng %s bị hỏng\n"
IDS_STREAMUNKNOWN              "Định dạng chưa biết của dữ liệu dòng %s\n"
IDS_SAVETOPROFILE              "Lưu các thiết lập hiện tại vào một mẫu mới..."
IDS_PROFILESORGANIZE           "Quản lý mẫu..."
IDS_NEWPROFILE                 "Mẫu Mới"
IDS_SETOPTIONS                 "Đặt các tùy chọn nén mặc định"

; These profile names are stored in Registry after first WinRAR execution
; and then read from Registry. You need to uninstall and re-install
; WinRAR to see their new values if you had older ones in Registry.
IDS_DEFAULTPROFILE             "Mẫu Mặc định"
IDS_PROFILEMAIL                "Tạo đính kèm e-mail"
IDS_PROFILEBACKUP              "Sao lưu các tập tin đã chọn"
IDS_PROFILEVOLUMES             "Tạo các phần 10 MB"
IDS_PROFILEZIP                 "Tập tin nén ZIP (nén thấp)"

IDS_INVALIDNAME                "Tên tập tin sai %s"
IDS_FILETIMEANY                "Trong bất kỳ thời gian nào"
IDS_FILEMTIMEOLDER             "Cũ hơn"
IDS_FILEMTIMENEWER             "Mới hơn"
IDS_FILEMTIMEBEFORE            "Chỉnh sửa trước"
IDS_FILEMTIMEAFTER             "Chỉnh sửa sau"
IDS_FILECTIMEOLDER             "Tạo trước"
IDS_FILECTIMENEWER             "Tạo sau"
IDS_FILECTIMEBEFORE            "Được tạo trước"
IDS_FILECTIMEAFTER             "Được tạo sau"
IDS_FILEATIMEOLDER             "Truy cập trước"
IDS_FILEATIMENEWER             "Truy cập sau"
IDS_FILEATIMEBEFORE            "Đã truy cập trước"
IDS_FILEATIMEAFTER             "Đã truy cập sau"
IDS_ARCTIMECURRENT             "Thời gian hệ thống hiện tại"
IDS_ARCTIMEORIGINAL            "Thời gian tập tin nén gốc"
IDS_ARCTIMELATEST              "Thời gian tập tin cuối cùng"
IDS_SELECTREPAIRFOLDER         "Chọn thư mục cho các tập tin nén đã sửa"
IDS_ASKSTOREPSWCVT             "Bạn có chắc bạn muốn mã hóa các tập tin nén đã chuyển đổi?"
IDS_ALLARCHIVES                "Tất cả các tập tin nén"
IDS_ALLARCHIVESANDSFX          "Tất cả các tập tin nén bao gồm tự-giải nén"
IDS_ALLFILES                   "Tất cả các tập tin"
IDS_WRONGFMT                   "Phiên bản sai của module %s. Xin hãy lặp lại sự cài đặt WinRAR."

; These strings allow to add links to distributor sites to "Help" menu.
; Change it only if you are the official WinRAR distributor, otherwise
; keep it unmodified.
IDS_LOCALSITE                  "Mua WinRAR"
IDS_LOCALSITEURL               "https://www.rarlab.com"
IDS_LOCALSITE2                 "Thông tin về giấy phép WinRAR"
IDS_LOCALSITEURL2              "https://www.rarlab.com"

IDS_SFXOPTTITLE                "Các tùy chọn SFX Nâng cao"
IDS_SFXSCRIPTTITLE             "Lỗi tìm kiếm tập tin, không thể đồng bộ hóa tập tin nén"
IDS_SELECTFILESTOADD           "Chọn các tập tin để thêm"
IDS_SELECTFILESTOEXCL          "Chọn các tập tin để loại trừ"
IDS_CORRECTINGNAME             "Đang thử sửa chữa tên tập tin sai"
IDS_UNPCANNOTMERGE             "Bạn cần bắt đầu giải nén từ một phần trước đó để giải nén %s"
IDS_SETTINGSEXPORTED           "Các thiết lập WinRAR được lưu vào tập tin %s"
IDS_SETTINGSIMPORTED           "Các thiết lập WinRAR được phục hồi từ tập tin %s"
IDS_BETA                       "beta"
IDS_32BIT                      "32-bit"
IDS_64BIT                      "64-bit"
IDS_OPFAILED                   "thao tác thất bại"
IDS_SUBHEADCORRUPT             "Tìm thấy đầu mục dữ liệu hỏng, đã bỏ qua"
IDS_SUBHEADUNKNOWN             "Định dạng đầu mục dữ liệu chưa biết, đã bỏ qua"
IDS_SUBHEADDATACRC             "Khối dữ liệu %s hỏng"
IDS_WIZUNPARCNAME              "Xin hãy chọn một tập tin nén để giải nén và ấn nút \"Tiếp\".\nBạn có thể thả biểu tượng tập tin nén vào hộp thoại này hay sử dụng nút \"Duyệt...\" để tìm tập tin nén bằng tay."
IDS_WIZNEWARCNAME              "Xin hãy nhập tên tập tin nén để tạo và ấn nút \"Tiếp\". Hoặc nhập bằng tay hoặc sử dụng nút \"Duyệt...\" để chọn một thư mục và tên cho tập tin nén được tạo ra."
IDS_WIZADDARCNAME              "Xin hãy chọn một tập tin nén để cập nhật và ấn nút \"Tiếp\".\nBạn có thể thả biểu tượng tập tin nén vào hộp thoại này hay sử dụng nút \"Duyệt...\" để tìm tập tin nén bằng tay."
IDS_WIZDESTFOLDERTITLE         "Chọn một thư mục đích cho các tập tin được giải nén"
IDS_WIZARCNAMENEEDED           "Xin hãy nhập tên tập tin nén, đó là trường yêu cầu."
IDS_CHOOSENEWARC               "Chọn một thư mục đích và tên cho tập tin nén mới"
IDS_PATHSRELATIVE              "Lưu đường dẫn tương đối"
IDS_PATHSFULL                  "Lưu đường dẫn đầy đủ"
IDS_PATHSNONE                  "Không lưu đường dẫn"
IDS_PATHSABS                   "Lưu đường dẫn đầy đủ bao gồm ký tự ổ đĩa"
IDS_CONTINUE                   "&Tiếp tục"
IDS_PAUSED                     "Đang tạm dừng, ấn \"Tiếp tục\" để tiếp tục"
IDS_SCANERROR                  "Không thể đọc nội dung của %s"
IDS_NOTVOLUME                  "Không là một phần"
IDS_RECVOLDIFFSETS             "%s và %s thuộc về những tập hợp khác nhau"
IDS_RECVOLMISSING              "%d phần bị thiếu"
IDS_RECVOLFOUND                "%d phần phục hồi được tìm thấy"
IDS_RECVOLALLEXIST             "Không có gì để xây dựng lại"
IDS_RECVOLCANNOTFIX            "Không thể xây dựng lại"
IDS_RECONSTRUCTING             "Đang xây dựng lại..."
IDS_CREATING                   "Đang tạo %s"
IDS_RENAMING                   "Đang đổi tên %s thành %s"
IDS_RARRECVOL                  "Phần phục hồi RAR"
IDS_ASKTORECVOL                "Bạn có muốn xây dựng lại những phần đã mất?"
IDS_CHOOSESEPARCFOLDER         "Chọn một thư mục đích cho các tập tin nén được tạo"
IDS_NTFSREQUIRED               "Lỗi ghi: chỉ hệ thống tập tin NTFS mới hỗ trợ các tập tin lớn hơn 4 GB"
IDS_FAT32SIZE                  "Hệ thống tập tin FAT32 không hỗ trợ các tập tin 4 GB hoặc lớn hơn"
IDS_ERRCHANGEATTR              "Không thể đổi thuộc tính của %s"
IDS_SELECTICON                 "Chọn Icon"
IDS_SELECTLOGO                 "Chọn Logo"
IDS_ADVWRONGSFX                "Module SFX đã chọn không hỗ trợ các tùy chọn nâng cao"
IDS_FILEINFO                   "Thông tin tập tin"
IDS_INFOSCANINPROGRESS         "Xin hãy đợi cho đến khi việc quét các tập tin hoàn tất hoặc ấn \"Hủy\" để đóng hộp thoại"
IDS_INFODONE                   "Hoàn tất"
IDS_INFOCALCULATING            "Đang tính toán"
IDS_WRONGSFXVER                "Module SFX mặc định không hỗ trợ tập tin nén RAR %d.%d"
IDS_HEADENCMISMATCH            "Không thể mã hóa tập tin nén đã chứa các tập tin đã mã hóa"
IDS_CANNOTEMAIL                "Không thể gửi email tập tin %s"
IDS_GROUPARCCONFIRM            "Bạn có chắc bạn muốn áp dụng các thiết lập đã chỉ rõ cho tất cả các tập tin nén được tìm thấy trong các tập tin và thư mục đã chọn?"
IDS_COLUMNTITLEFILE            "Tập tin"
IDS_COLUMNTITLELOCATION        "Vị trí"
IDS_COLUMNTITLECONTEXT         "Ngữ cảnh"
IDS_KEYLOCATE                  "Vị trí"
IDS_TIPLOCATE                  "Hiển thị tập tin trong cửa sổ WinRAR chính"
IDS_CURRENTFOLDER              "Thư mục Hiện tại"
IDS_SELECTEDITEMS              "Các ổ đĩa cứng cục bộ"
IDS_ITEMSFOUND                 "%u tìm thấy"
; Button label to stop commands like "Find" and "Repair". Keep text short.
IDS_STOP                       "Dừng"

; WinRAR home page.
IDS_HOMEURL                    "https://www.rarlab.com"

; This string specifies URL, which will be opened when user pressed
; "Buy online" in registration reminder dialog. Change it only if you are
; the official WinRAR dealer, otherwise keep it unmodified.
IDS_BUYURL                     "https://www.rarlab.com/shop2rarlab-index.php?prod=winrar&x-source=winraronly"

; Reminder dialog information. For official WinRAR dealers only.
; Please do not change or translate this string if you are not a dealer.
IDS_REMINDERINFO               "Thông tin nhắc nhở"

; WinRAR themes page.
IDS_THEMEPAGEURL               "https://www.rarlab.com/themes.htm"

IDS_SELCOUNT                   "%d đã chọn"
IDS_CVTDIFCONTENTS             "Nội dung của các tập tin nén gốc và đã chuyển đổi không bằng nhau"
IDS_CONVERTINGARCHIVES         "Đang chuyển đổi các tập tin nén"
IDS_CVTSELFOLDERTITLE          "Chọn thư mục cho các tập tin nén đã chuyển đổi"
IDS_FILEEXIST                  "Tập tin đã tồn tại"
IDS_SKIPENCARC                 "Đang bỏ qua các tập tin nén đã mã hóa"
IDS_CVTTOOLARGE                "%s quá lớn, chưa chuyển đổi"
IDS_FINDFILE                   "Tìm tập tin"
IDS_CALCCRC                    "Đang tính tổng kiểm tra: %d%% hoàn tất"
IDS_PROCESSING                 "Đang xử lý %s"
IDS_STREAMWARNING              "Tên tập tin nén đã chỉ có chứa dấu hai chấm, bạn có thể không thể truy nhập được tập tin nén với tên như vậy. Ấn \"Đồng ý\" nếu bạn biết dòng NTFS là gì, ngược lại chọn \"Hủy\" và đổi tên."
IDS_EXTRDLGTITLE               "Đường dẫn và các tùy chọn giải nén"
IDS_WINRARDESC                 "Xử lý các định dạng tập tin nén RAR, ZIP và tập tin nén khác"
IDS_DRAGFAILED                 "Thao tác kéo và thả thất bại"
IDS_SELECTVIRSCAN              "Chọn trình quét virut"
IDS_ASKSETVIRSCAN              "Bạn cần chỉ rõ một chương trình quét virut.\nẤn \"Đồng ý\" và sau đó ấn \"Trợ giúp\" để có thêm thông tin."
IDS_WAITVIRSCAN                "Đang đợi trình quét virut hoàn thành"
IDS_USERDEFINED                "Người dùng định nghĩa"
IDS_TOOMANYFILESREAD           "%d tập tin đã đọc. Số lớn như vậy có thể chỉ báo rằng tập tin nén đã bị hỏng.\nBạn có muốn tiếp tục đọc nó?"
IDS_TOTALERRORS                "Tổng số lỗi: %d"
IDS_SELECTREPORTNAME           "Chọn tên tập tin báo cáo"
IDS_CREATINGREPORT             "Đang tạo báo cáo"
IDS_CANNOTPRINT                "Không thể in %s"
IDS_ENDOFARCHIVE               "Cuối tập tin nén"
IDS_REPORTFILES                "Tập tin"
IDS_YES                        "Có"
IDS_REPORTDATE                 "Báo cáo sinh ra lúc %s"
IDS_RECVOLLIMIT                "Tổng số phần bình thường và phục hồi không được vượt quá %d"
IDS_VOLUMENUMBER               "số %d"
IDS_REPORTDIRECTORY            "Thư mục"
IDS_EXTRDELCONFIRM             "Bạn có muốn xóa tập tin nén đã giải nén?"
IDS_WAITFOROTHERCOPY           "Đang đợi bản sao WinRAR khác"
IDS_THEME                      "Giao diện"
IDS_DEFAULTTHEME               "Giao diện mặc định"
IDS_CONFIRMTHEMEINSTALL        "Bạn có muốn cài đặt giao diện WinRAR chứa trong \"%s\"?"
IDS_INSTALLNEWTHEME            "Cài đặt giao diện mới"
IDS_SELECTTHEMEFILE            "Chọn tập tin giao diện"
IDS_THEMEINSTALLED             "Giao diện đã được cài đặt. Sử dụng trình đơn 'Tùy chọn/Giao diện' để chọn nó."
IDS_BLOCKCONTENTS              "Nội dung nguy hiểm tiềm tàng đã bị chặn."
IDS_TOOLARGESFX                "Kích thước module SFX không được vượt quá %u byte."
IDS_TIMELEFT                   "Thời gian còn lại"
IDS_SAVEARCAS                  "Lưu bản sao tập tin nén thành"
IDS_CANNOTCOPY                 "Không thể sao chép %s sang %s"
IDS_SAVESETTINGS               "Lưu các thiết lập WinRAR thành"
IDS_LOADSETTINGS               "Nạp các thiết lập WinRAR từ"
IDS_CREATEINI                  "Tạo tập tin WinRAR.ini"
IDS_INICREATED                 "Tập tin %s đã được tạo thành công. Bạn có thể sao chép nó đến vị trí mong muốn. Ấn \"Trợ giúp\" để biết thêm thông tin."
IDS_SECONDDRAGERROR            "Không thể bắt đầu một thao tác kéo và thả mới trong khi thao tác trước đó đang kích hoạt."
IDS_TOOLARGESFXARC             "Tập tin nén SFX quá lớn. Windows không thể chạy tập tin thực thi vượt quá 4 GB."
IDS_ZIPVOLCANNOTFSFX           "Tập tin nén ZIP không thể tự giải nén"
IDS_CALCCRCALLVOL              "Đang tính tổng kiểm tra của tất cả các phần."
IDS_WRONGDLLBITS               "WinRAR %d bit không thể nạp module %s %d bit. Bạn cần cài lại WinRAR."
IDS_NOTENOUGHDISK              "Không đủ đĩa trống cho %s."
IDS_INARCHIVE                  "trong tập tin nén %s"
IDS_PASSWORDDEFAULT            "Đặt mật khẩu mặc định"
IDS_PASSWORDFILE               "Nhập mật khẩu cho tập tin đã mã hóa"
IDS_PASSWORDARCHIVE            "Nhập mật khẩu cho tập tin nén đã mã hóa"
IDS_MASTERINFOORG              "Nhập mật khẩu chính cho các tập tin nén đã mã hóa bằng mật khẩu, hoặc để trống để xóa mật khẩu chính."
IDS_MASTERINFOPROF             "Nhập mật khẩu chính cho các tập tin nén đã mã hóa bằng mật khẩu."
IDS_MASTERACCESS               "Nhập mật khẩu chính để truy cập các bản ghi mật khẩu hoặc nhập một chuỗi khác để đặt mật khẩu cho tập tin nén"
IDS_PROFILENAME                "Tập tin: %s"
IDS_CORRPUTPSWDATA             "Mật khẩu đã lưu bị hỏng"
IDS_TITLELABEL                 "Nhãn"
IDS_TITLEMASK                  "Mặt nạ"
IDS_NOTIFYPSWMAN1              "Các mật khẩu được lưu trữ trong trình quản lý mật khẩu không được mã hóa an toàn."
IDS_NOTIFYPSWMAN2              "Bất kỳ ai truy nhập vào máy tính của bạn đều có thể thấy chúng."
IDS_NOTIFYPSWMAN3              "Chỉ sử dụng thuộc tính này nếu máy tính của bạn được bảo vệ khỏi sự truy nhập bất hợp pháp."
IDS_PSWLABELEXISTS             "Mật khẩu hay nhãn như vậy đã tồn tại."
IDS_PSWLABELENTERED            "Nhãn mật khẩu đã nhập."
IDS_USELABELNOTIFY             "Mật khẩu phù hợp với nhãn này sẽ được sử dụng."

; Abbreviations for bytes and kilo-, mega-, giga-, terabytes.
IDS_B                          "B"
IDS_KB                         "KB"
IDS_MB                         "MB"
IDS_GB                         "GB"
IDS_TB                         "TB"

IDS_NEWREGKEYTITLE             "Tìm thấy khóa đăng ký mới"
IDS_NEWREGKEY                  "Bạn có muốn thay thế khóa đăng ký WinRAR hiện tại bằng cái mới?"
IDS_COMPRESSEDSFX              "Module SFX bị nén bởi trình nén EXE. Biểu tượng, logo và các tài nguyên khác không thể được cập nhật trong module như thế."
IDS_CANNOTZIPVOLSFX            "Không thể chuyển đổi các phần ZIP thành SFX. Các phần ZIP không thể tự-giải nén."
IDS_NOTIFYSYNCMODE1            "Trong chế độ \"Đồng bộ hóa nội dung tập tin nén\" WinRAR có thể xóa các tập tin đã nén, dẫn đến việc mất dữ liệu nếu sử dụng không đúng."
IDS_NOTIFYSYNCMODE2            "Xin hãy đọc trợ giúp WinRAR để hiểu chế độ này hoạt động như thế nào trước khi sử dụng nó."
IDS_NEWERWINRAR                "Bạn có thể cần một phiên bản WinRAR mới hơn."
IDS_UNKENCMETHOD               "Phương pháp mã hóa chưa biết trong %s"
IDS_WRONGPASSWORD              "Mật khẩu chỉ rỏ không chính xác."
IDS_WRONGFILEPASSWORD          "Mật không không đúng cho %s"
IDS_AREADAMAGED                "Hỏng %d byte tại %08x %08x"
IDS_BLOCKSRECOVERED            "%u khối được phục hồi, %u khối được di chuyển"
IDS_RRDAMAGED                  "Bản ghi phục hồi bị hỏng."
IDS_TESTINGRR                  "Đang kiểm tra bản ghi phục hồi"
IDS_JUNCTION                   "Nối"
IDS_SYMLINK                    "Symlink"
IDS_HARDLINK                   "Hardlink"
IDS_FILECOPY                   "Tham chiếu tập tin"
IDS_CHDIRERROR                 "Không thể đặt %s thành thư mục hiện tại"
IDS_CHECKTEMPPERM              "Xin hãy kiểm tra sự cho phép của thư mục WinRAR với các tập tin tạm hoặc chỉ ra một thư mục tạm khác trong các thiết lập WinRAR."
IDS_INCOMPATSWITCH             "Khóa %s không được hỗ trợ cho định dạng tập tin nén RAR %d.x."
IDS_SEARCHDUPFILES             "Đang tìm các tập tin đồng nhất"
IDS_UNKNOWNEXTRA               "Trường mở rộng chưa biết trong %s."
IDS_CORRUPTEXTRA               "Trưởng mở rộng bị hỏng %s trong %s"
IDS_COPYERROR                  "Không thể sao chép %s đến %s."
IDS_COPYERRORHINT              "Bạn cần giải nén toàn bộ tập tin nén để tạo các mục tham chiếu tập tin."
IDS_COPYINGDATA                "Đang sao chép dữ liệu."
IDS_CANNOTCREATELNKS           "Không thể tạo liên kết tượng trưng %s"
IDS_CANNOTCREATELNKH           "Không thể tạo liên kết cứng %s"
IDS_ERRLNKTARGET               "Trước tiên bạn phải giải nén mục tiêu liên kết"
IDS_NEEDADMIN                  "Bạn có thể cần chạy WinRAR dưới quyền quản trị"
IDS_ARCDRIVERO                 "Xin hãy đổi tên tập tin nén. %s thì chỉ đọc."
IDS_DICTOUTMEM                 "Không đủ bộ nhớ cho từ điển nén %d MB, đã đổi thành %d MB."
IDS_USESMALLERDICT             "Xin hãy sử dụng từ điển nén nhỏ hơn."
IDS_EXTRDICTOUTMEM             "Không đủ bộ nhớ để giải nén với từ điển nén %u GB."
IDS_SUGGEST64BIT               "Phiên bản WinRAR 64-bit là cần thiết."
IDS_LARGEDICT1                 "%d MB từ điển sử dụng nhiều bộ nhớ để nén và giải nén các tập tin."
IDS_LARGEDICT2                 "Việc chọn từ điển %d MB hay nhỏ hơn được ưa chuộng nếu tập tin nén có thể được giải nén trên các máy tính khác nhau với ít bộ nhớ hơn."

; Specify the name of your language in English here. WinRAR can use it
; as a language identifier when accessing multilanguage resources.
; Do not translate it to your language, use English language name.
; Only English characters and spaces are allowed.
; For example, "Russian", "Chinese Simplified", "Valencian".
IDS_LANGNAME                   "Vietnamese"

IDS_PREPARING_FILES            "Đang chuẩn bị các tập tin..."
IDS_NAMEENCODINGSAVE           "&Lưu hiện tại"
IDS_NAMEENCODINGHELP           "&Trợ giúp"
IDS_NAMEENCODINGDEFAULT        "&Mặc định"
IDS_SFXLOGOFORMAT              "Định dạng biểu tượng SFX %s"
IDS_WARNMANYVOLUMES            "%u / %llu đã được tạo. Bạn có muốn tiếp tục không?"

; Please pay attention that GETARCADV dialog provides a small enough space
; for "When done" drop down list. So if your translation of "Keep PC running"
; and other strings from this list is much longer than English and does not
; fit to the list, you may omit some words, like "Keep running", "PC running"
; or even "Run", "Off", "Sleep", "Hibernate".
IDS_POWERKEEP                  "Không làm gì"
IDS_POWEROFF                   "Tắt máy"
IDS_POWERHIBERNATE             "Ngủ đông"
IDS_POWERSLEEP                 "Ngủ"
IDS_POWERRESTART               "Khởi động lại"
IDS_POWERCLOSE                 "Đóng WinRAR"

IDS_WARNTRUSTEDARCONLY         "Tùy chọn này có rủi ro bảo mật. Chỉ bật nó cho tập tin nén từ các nguồn đáng tin cậy."
IDS_OPENERRATIME               "Để mở tệp này, bạn có thể cần tắt tùy chọn \"Giữ thời gian truy cập cuối cùng của tệp nguồn\"."
IDS_FILESREAD                  "%u tệp đã đọc"
IDS_READERRORTRUNC             "%s nén không đầy đủ do lỗi đọc."
IDS_READERRORCOUNT             "%u tệp nén không đầy đủ do lỗi đọc."
IDS_RAR4ONLY                   "Chỉ dành cho tập tin nén RAR4"
IDS_DIRNAMEEXISTS              "Thư mục đã tồn tại"
IDS_INACCESSIBLE               "Không thể tiếp cận"
IDS_TRUNCPSW                   "Mật khẩu vượt quá độ dài tối đa %u ký tự và sẽ bị cắt ngắn."
IDS_ADJUSTVALUE                "Chỉnh giá trị %s thành %s."
IDS_SINGLETOPITEM              "Chỉ một trình đơn có thể hiển thị nếu trình ngữ chồng nhau bị tắt. Tùy chỉnh bằng cách sử dụng \"Trình đơn chuột phải...\"."
IDS_POWERMANACTIONINFO         "WinRAR sẽ đưa máy tính vào chế độ sau trong %u giây:"
IDS_NEVER                      "Không bao giờ"
IDS_MARKOFWEBOFFICE            "Cho hồ sơ văn phòng"
IDS_MARKOFWEBEXEOFFICE         "Cho các tệp thực thi và văn phòng"
IDS_MARKOFWEBALL               "Cho tất cả các tệp"
IDS_MARKOFWEBCUSTOM            "Cho người dùng xác định loại"

; Megahertz abbreviation for memory frequency in "Benchmark" window.
IDS_MHZ                        "MHz"

IDS_RESSPEED                   "Tốc độ %s KB/s"
IDS_NUMTHREADS                 "%u chủ đề"
IDS_DICTNOTALLOWED             "Từ điển %u GB vượt quá giới hạn %u GB và cần nhiều hơn %u GB bộ nhớ để giải nén."
IDS_DICTEXCEEDSRAM             "Nó cũng vượt quá dung lượng bộ nhớ đã cài đặt và có thể khiến hệ thống trích xuất cực kỳ chậm hoặc thậm chí không phản hồi."
IDS_DICTSUGGESTCANCEL          "Nên hủy bỏ."
IDS_DICTCOMPRLIMIT             "Từ điển %u GB vượt quá giới hạn %u GB và không được phép khi nén dữ liệu."

; Program name. Normally shouldn't be edited.
IDS_WINRAR                     "WinRAR"

IDS_DONOTSAVE                  "Không lưu"
IDS_SAVE                       "Lưu"
IDS_RESTORE                    "Khôi phục"
IDS_REMOVE                     "Di chuyển"
IDS_NEEDSFX64                  "Mô-đun tự giải nén 64-bit là cần thiết cho từ điển nén %u GB."
IDS_SKIPUNSAFELINK             "Bỏ qua liên kết %s -> %s có khả năng không an toàn. Đối với các kho lưu trữ từ một nguồn đáng tin cậy, hãy đặt tùy chọn \"Cho phép đường dẫn tuyệt đối trong các liên kết tượng trưng\" để vẫn giải nén nó."
IDS_TRUNCSERVICE               "Bị cắt ngắn tại khối dịch vụ: %s"
IDS_HEADERQO                   "mở nhanh thông tin"
IDS_HEADERRR                   "hồ sơ phục hồi"
IDS_PRIVILEGEMANAGEMENT        "Quản lý đặc quyền của người dùng"
IDS_LOCKINMEMORYNEEDED         "Tùy chọn "\" Trang bộ nhớ lớn\" yêu cầu gán \" các trang khóa trong bộ nhớ \" đặc quyền cho tài khoản người dùng hiện tại. Bạn có muốn WinRAR gán nó không?"
IDS_PRIVILEGEASSIGNED          "Đặc quyền của người dùng đã được gán thành công và sẽ được kích hoạt sau khi Windows khởi động lại."

; Button labels for message prompts.
IDS_NO                         "Không"
IDS_CANCEL                     "Hủy"
IDS_RETRY                      "Thử lại"
IDS_HELP                       "Trợ giúp"


; We use DS_SHELLFONT and DIALOGEX instead of DIALOG to avoid a bug
; causing the incorrect property sheet scaling with 120 DPI (125%) in XP.
; Property sheet contents is either larger or smaller than needed.
; It is also mentioned here: https://devblogs.microsoft.com/oldnewthing/20050208-00/?p=36503



:DIALOG GETARC

SIZE                           "100*100"
CAPTION                        "Xác định kích thước"
IDC_GETARCARCNAMETITLE         "&Tên tập tin nén"
IDC_GETARCFINDNAME             "&Duyệt..."
IDC_GETARCSELECTPROFILE        "&Mẫu..."
IDC_GETARCARCFORMAT            "Định dạng tập tin nén"
IDC_RAR5                       "&RAR5"
IDC_ZIP                        "&ZIP"
IDC_GETARCCOMPRTITLE           "&Phương pháp nén"
IDC_GETARCDICTTITLE            "&Kích thước từ điển"
IDC_GETARCCOMBOVOLSIZETITLE    "&Chia ra các phần, kích thước"
IDC_GETARCUPDATETITLE          "C&hế độ cập nhật"
IDC_GETARCARCOPTIONS           "Tùy chọn nén"
IDC_GETARCCHECKMOVE            "Xóa các tập tin &sau khi nén"
IDC_GETARCCHECKSFX             "Tạo tập tin nén SF&X"
IDC_GETARCCHECKSOLID           "Tạ&o tập tin nén đặc"
IDC_GETARCCHECKRR              "Thêm &bản ghi phục hồi"
IDC_GETARCCHECKTEST            "&Kiểm tra các tập tin đã nén"
IDC_GETARCLOCK                 "Khóa tập t&in nén"
IDC_GETARCSETPASSWORD          "Đặt &mật khẩu..."


:DIALOG GETARCADV

SIZE                           "100*100"
CAPTION                        "Nâng cao"
IDC_GETARCNTFSOPTIONS          "Tùy chọn NTFS"
IDC_GETARCSECURITY             "&Lưu bảo mật tập tin"
IDC_GETARCSTREAMS              "Lưu các &dòng tập tin"
IDC_GETARCSYMLINKS             "Lưu các liên kết &tượng trưng dưới dạng liên kết"
IDC_GETARCHARDLINKS            "Lưu các liên kết &cứng dưới dạng liên kết"
IDC_GETARCRECOVERYBOX          "&Bản ghi phục hồi"
IDC_GETARCRECOVERYTEXT         "phần trăm"
IDC_GETARCVOLUMES              "Phần"
IDC_GETARCVOLPAUSE             "&Tạm dừng sau mỗi phần"
IDC_GETARCRECVOLUMESTEXT       "phần phụ&c hồi"
IDC_GETARCPACKDETAILS          "&Nén..."
IDC_GETARCSFXADVANCED          "Tùy chọn SF&X..."
IDC_GETARCPOWERMODETITLE       "Sau &khi hoàn thành"
IDC_GETARCSYSTEM               "Hệ thống"
IDC_GETARCBACKGROUND           "Nén tr&ong nền"
IDC_GETARCWAITOTHERS           "Chờ nếu các bản &sao WinRAR khác đang hoạt động"


:DIALOG GETARCOPT

SIZE                           "100*100"
CAPTION                        "Tùy chọn"
IDC_GETARCDELETEMODE           "Chế độ xóa"
IDC_GETARCREMOVE               "&Xóa các tập tin"
IDC_GETARCRECYCLEBIN           "Chuyển các tập tin vào &Thùng Rác"
IDC_GETARCWIPE                 "Xóa &sạch các tập tin"
IDC_GETARCWIPEIFPASSWORD       "Xóa sạch các tập tin nếu &mật khẩu được đặt"
IDC_GETARCQUICKOPENINFO        "Thông tin mở nhanh"
IDC_GETARCQUICKOPENNONE        "&Không thêm"
IDC_GETARCQUICKOPENAUTO        "Thêm cho các tập tin &lớn"
IDC_GETARCQUICKOPENALWAYS      "Thêm cho tất &cả các tập tin"
IDC_GETARCARCFEATURES          "Các đặc tính tập tin nén"
IDC_GETARCBLAKE2               "Sử dụng tổng kiểm tra tập tin &BLAKE2"
IDC_GETARCSAVECOPIES           "Lưu các tập tin tương tự &dưới dạng tham chiếu"
IDC_GETARCSAVEORIGDATA         "Lưu tên và thời gian &gốc của tệp nén"
IDC_GETARCCMDSWITCHESTITLE     "Công tắc &bổ sung"


:DIALOG GETARCFILES

SIZE                           "100*100"
CAPTION                        "Tệp"
IDC_GETARCFILESTOADD           "Tận tin để &thêm"
IDC_GETARCSELECTNAMES          "T&hêm vào..."
IDC_GETARCFILESTOEXCLUDE       "Tập tin loại t&rừ"
IDC_GETARCSELECTEXCLNAMES      "Thêm &vào..."
IDC_GETARCFILESTOSTORE         "Tập tin để &lưu trữ mà không nén"
IDC_GETARCFILEPATHS            "Đường &dẫn tập tin"
IDC_GETARCARCHIVEOPT           "Tập tin nén"
IDC_GETARCSEPARATEARCHIVES     "Đặt mỗi tập tin vào mỗi tập tin nén riêng &biệt"
IDC_GETARCSEPARATEDOUBLEEXT    "Mở rộng gấp đôi tập tin nén"
IDC_GETARCSEPARATESUBFOLDERS   "Tập tin nén trong thư mục riêng"
IDC_GETARCEMAILARCHIVE         "Gửi tập tin nén bằng &email đến"
IDC_GETARCEMAILDELETE          "và sau đó &xóa đi"


:DIALOG GETARCTIME

SIZE                           "100*100"
CAPTION                        "Thời gian"
IDC_GETARCFILETIMEOPTIONS      "Thời gian"
IDC_GETARCMTIME                "Thời gian &chỉnh sửa"
IDC_GETARCCTIME                "Thời gian &tạo"
IDC_GETARCATIME                "Thời gian truy cập lần cuối"
IDC_GETARCTIMEHIGHPRECISION    "Định dạng thời gian chính xác cao"
IDC_GETARCPRESERVEATIME        "Lưu trữ thời gian t&ruy cập cuối cùng"
IDC_GETARCFILESTOPROCESS       "Tập tin để xử lý"
IDC_GETARCINLCUDEFILES         "&Bao gồm các tập tin"
IDC_GETARCDAYSTITLE            "ngày"
IDC_GETARCHOURSTITLE           "giờ"
IDC_GETARCMINUTESTITLE         "phút"
IDC_GETARCARCTIMETITLE         "Thời gian tập tin nén"
IDC_GETARCSETARCTIME           "Đặt thời gian tập tin &nén thành"


:DIALOG GETARCBACKUP

SIZE                           "100*100"
CAPTION                        "Sao lưu"
IDC_GETARCBACKUPOPTIONS        "Tùy chọn sao lưu"
IDC_GETARCERASEDEST            "&Xóa nội dung đĩa đích trước khi nén"
IDC_GETARCADDARCHIVE           "&Chỉ thêm các tập tin với thuộc tính \"Tập tin nén\" được đặt"
IDC_GETARCCLEARARCHIVE         "Xóa &thuộc tính \"Tập tin nén\" sau khi nén"
IDC_GETARCOPENSHARED           "&Mở các tập tin chia sẻ"
IDC_GETARCGENERATENAME         "&Phát sinh tên tập tin nén theo mặt nạ"
IDC_GETARCKEEPVERSIONS         "&Giữ các phiên bản tập tin trước đó"


:DIALOG GETARCCMT

SIZE                           "100*100"
CAPTION                        "Chú thích"
IDC_GETARCCMTFILETITLE         "Nhập chú thích từ &tập tin"
IDC_GETARCFINDCMTFILE          "&Duyệt..."
IDC_GETARCCMTTEXTTITLE         "Nhập &chú thích thủ công"


:DIALOG GETPASSWORD2

SIZE                           "100*100"
CAPTION                        "Nhập mật khẩu"
; SS_PATHELLIPSIS inserts dots only before the path separator, but we set
; the name without path in these fields, thus SS_WORDELLIPSIS.
IDC_ENTERTEXT                  "&Nhập mật khẩu"
IDC_REENTERTEXT                "Nhập &lại mật khẩu để xác minh"
IDC_SHOWPASSWORD               "&Hiển thị mật khẩu"
IDC_ENCRYPTHEADERS             "Mã hóa các tên &tập tin"
IDC_ENCRZIPLEGACY              "Mã hóa &ZIP"
IDC_PASSWORDALLARCHIVES        "Sử dụng cho tất &cả các tập tin nén"
IDC_PASSWORDORGANIZE           "&Quản lý mật khẩu..."
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy bỏ"
IDHELP                         "Trợ giúp"



:DIALOG ORGREQMASTER

SIZE                           "100*100"
CAPTION                        "Mật khẩu chính"
IDC_ORGMASTERINFO1             "Mật khẩu chính được yêu cầu để truy cập các bản ghi mật khẩu được mã hóa."
IDC_ORGMASTERINFO2             "Nhấp vào \"Đóng \" để quay lại cửa sổ trước đó và nhập mật khẩu chính. Nhấp vào \"Đặt lại\" để xóa tất cả các bản ghi mật khẩu và xóa mật khẩu chính."
IDCANCEL                       "Đón&g"
IDOK                           "&Cài lại"


:DIALOG WARNPROFPASSWORD

SIZE                           "100*100"
CAPTION                        "Mật khẩu lưu trữ"
IDC_WARNPROFPSWINFO            "Trừ khi mật khẩu chính được đặt, mật khẩu được lưu trong hồ sơ nén không được mã hóa an toàn và bất kỳ ai có quyền truy cập vào máy tính của bạn đều có thể đọc được."
IDC_WARNPROFPSWSAVE            "&Lưu"
IDC_WARNPROFPSWMASTER          "Đặt &mật khẩu"
IDCANCEL                       "&Hủy"
IDHELP                         "&Trợ giúp"


:DIALOG ORGPASSWORDS

SIZE                           "100*100"
CAPTION                        "Sắp xếp mật khẩu"
IDC_ORGPSWADD                  "&Thêm"
IDC_ORGPSWDELETE               "&Xóa"
IDC_ORGPSWEDIT                 "&Chỉnh sửa"
IDC_ORGPSWUP                   "&Lên"
IDC_ORGPSWDOWN                 "X&uống"
IDC_ORGPSWAUTOCOMPLETE         "Áp dụng tự động &hoàn thành"
IDC_ORGPSWAUTODETECT           "Tự &phát hiện mật khẩu"
IDC_ORGPSWMASTERPSW            "Đặt &mật khẩu…"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG PASSWORDITEM

SIZE                           "100*100"
CAPTION                        "Thông tin mật khẩu"
IDC_PSWINFOTEXTTITLE           "&Mật khẩu"
IDC_PSWINFOLABELTITLE          "&Nhãn mật khẩu (tùy chọn)"
IDC_PSWINFOMASKTITLE           "Chọn cho các &tập tin nén (tùy chọn)"
IDC_PSWINFOSILENT              "Chấp nhận không cần &xác nhận"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG ONETIMENOTIFY

SIZE                           "100*100"
CAPTION                        "Thông báo Winrar"
IDOK                           "Đồng ý"
IDC_OTNOTIFYNOAGAIN            "&Không hiện lần nữa"


:MENU MAIN_MENU

CM_MAINPOPUPFILE               "&Tập tin"
CM_OPENARCHIVE                 "&Mở tập tin nén\tCtrl+O"
CM_SAVEARCHIVEAS               "&Lưu bản sao tập tin nén thành..."
CM_MAINPOPUPDRIVE              "Đổi ổ đĩ&a\tCtrl+D"
CM_FILEPASSWORD                "Đặt mật &khẩu mặc định\tCtrl+P"
CM_COPYTOCLIPBOARD             "&Sao chép các tập tin vào clipboard\tCtrl+C"
CM_PASTEFROMCLIPBOARD          "&Dán các tập tin từ clipboard\tCtrl+V"
CM_COPYFULLNAMES               "Sao ché&p đường dẫn"
CM_FILESELECTALL               "Chọ&n tất cả\tCtrl+A"
CM_FILESELECT                  "&Chọn nhóm    \t +"
CM_FILEUNSELECT                "&Bỏ chọn nhóm  \t -"
CM_FILEINVERT                  "Đả&o ngược sự lựa chọn\t *"
CM_FILEEXIT                    "T&hoát"
CM_MAINPOPUPCOMMANDS           "&Lệnh"
CM_COMMANDSADD                 "&Thêm tập tin vào tập tin nén\tAlt+A"
CM_COMMANDSEXTRACTTO           "&Giải nén đến thư mục chỉ rõ\tAlt+E"
CM_COMMANDSTEST                "Kiểm t&ra các tập tin đã nén\tAlt+T"
CM_COMMANDSVIEW                "&Xem tập tin\tAlt+V"
CM_COMMANDSDELETE              "Xóa các tậ&p tin\tDel"
CM_COMMANDSRENAME              "Đổi tê&n tập tin\tF2"
CM_COMMANDSPRINT               "&In tập tin\tCtrl+I"
CM_COMMANDSEXTRACT             "Giải nén không &cần xác nhận\tAlt+W"
CM_COMMANDSCOMMENT             "T&hêm chú thích tập tin nén\tAlt+M"
CM_COMMANDSPROTECT             "&Bảo vệ tập tin nén khỏi hư hỏng\tAlt+P"
CM_COMMANDSLOCK                "Khó&a tập tin nén\tAlt+L"
CM_MAINPOPUPTOOLS              "Công cụ"
CM_COMMANDSWIZARD              "&Trình thuật sĩ"
CM_COMMANDSVIRSCAN             "&Quét virut tập tin nén\tAlt+D"
CM_COMMANDSCONVERT             "Ch&uyển đổi các tập tin nén\tAlt+Q"
CM_COMMANDSREPAIR              "&Sửa tập tin nén\tAlt+R"
CM_COMMANDSSFX                 "Chuyển đổi tập tin nén thành SF&X\tAlt+X"
CM_COMMANDSFIND                "Tì&m tập tin\tF3"
CM_COMMANDSINFO                "&Hiển thị thông tin\tAlt+I"
CM_COMMANDSREPORT              "Phát sinh &báo cáo\tAlt+G"
CM_COMMANDSBENCHMARK           "Đá&nh giá\tAlt+B"
CM_MAINPOPUPFAVORITES          "Ư&a thích"
CM_ADDFAVORITES                "Thêm &vào ưa thích...\tCtrl+F"
CM_ORGFAVORITES                "&Quản lý ưa thích..."
CM_MAINPOPUPOPTIONS            "Tùy c&họn"
CM_OPTIONS                     "&Cài đặt...\tCtrl+S"
CM_MAINPOPUPIMPEXP             "&Nhập/Xuất"
CM_IMPORTOPTIONS               "&Nhập các thiết lập từ tập tin"
CM_EXPORTOPTIONS               "&Xuất các thiết lập ra tập tin"
CM_CREATEINI                   "Tạo tập tin &WinRAR.ini"
CM_CLEARHISTORY                "Xóa lịch sử…"
CM_MAINPOPUPFILELIST           "&Danh sách tập tin"
CM_FLATFOLDERS                 "&Thư mục phẳng\tCtrl+H"
CM_COMMANDSSETLIST             "&Danh sách"
CM_COMMANDSSETDETAILED         "&Chi tiết"
CM_MAINPOPUPFOLDERTREE         "&Cây thư mục"
CM_COMMANDSSHOWDISKTREE        "&Hiển thị thư mục ổ đĩa\tCtrl+T"
CM_COMMANDSSHOWARCTREE         "Hiển &thị thư mục tập tin nén\tCtrl+T"
CM_MAINPOPUPTHEMES             "&Giao diện"
CM_THEMESORGANIZE              "&Quản lý giao diện..."
CM_THEMESDOWNLOAD              "&Lấy thêm giao diện..."
CM_THEMESDEFAULT               "Giao diện &mặc định"
CM_MAINPOPUPNAMEENCODING       "&Mã hóa tên\tCtrl+E"
CM_VIEWLOG                     "&Xem nhật ký...\tCtrl+L"
CM_CLEARLOG                    "Xó&a nhật ký"
CM_MAINPOPUPHELP               "Trợ &giúp"
CM_HELPCONTENTS                "&Trợ giúp"
CM_HELPWWW                     "&Trang chủ WinRAR"
CM_HELPABOUT                   "&Về WinRAR..."


:MENU VIEW_MENU

CM_VIEWPOPUPFILE               "&Tập tin"
CM_VIEWEREXIT                  "T&hoát"
CM_VIEWPOPUPEDIT               "&Chỉnh sửa"
CM_VIEWERCOPY                  "&Sao chép\tCtrl+C"
CM_VIEWERSELECTALL             "&Chọn Tất cả\tCtrl+A"
CM_VIEWERFIND                  "Tìm &kiếm\tCtrl+F"
CM_VIEWERFINDNEXT              "&Tìm Tiếp\tF3"
CM_VIEWPOPUPVIEW               "&Xem"
CM_VIEWERWINFONT               "Xem dạng văn bản W&indows\tCtrl+I"
CM_VIEWERDOSFONT               "Xem dạng văn bản &DOS\tCtrl+D"
CM_VIEWERUTF16LE               "Xem dạng &Unicode (UTF-16LE)"
CM_VIEWERUTF8                  "Xem dạng Unicode (UTF-&8)"
CM_VIEWERWORDWRAP              "&Cuộn dòng\tCtrl+S"
CM_VIEWERSETFONT               "Đặt &Font..."
CM_VIEWPOPUPHELP               "Trợ &giúp"
CM_VIEWERHELP                  "Trợ &giúp Trình xem\tF1"


:DIALOG FINDDLG

SIZE                           "100*100"
CAPTION                        "Tìm kiếm"
IDC_FINDEDITTITLE              "Tìm &kiếm:"
IDC_CHECKFINDWORD              "&Chỉ phù hợp với toàn bộ từ"
IDC_CHECKFINDCASE              "&Phân biệt hoa thường"
IDOK                           "&Tìm"
IDCANCEL                       "Hủy"


:DIALOG GETEXTRPATH

SIZE                           "100*100"
CAPTION                        "Chung"
IDC_EXTRDESTPATH               "Đường &dẫn đích (sẽ được tạo nếu không tồn tại)"
IDC_EXTRUPDATEMODE             "Chế độ cập nhật"
IDC_EXTRNORMALMODE             "Giải nén và tha&y thế các tập tin"
IDC_EXTRUPDATE                 "Giải nén và &cập nhật các tập tin"
IDC_EXTRFRESH                  "Chỉ làm mới các &tập tin đã có"
IDC_EXTROVERWRITEMODE          "Chế độ ghi đè"
IDC_EXTRASKOVERWRITE           "Hỏi trước &khi ghi đè"
IDC_EXTROVERWRITEALL           "&Ghi đè mà không cần nhắc nhở"
IDC_EXTRSKIPALL                "&Bỏ qua các tập tin đã có"
IDC_EXTRAUTORENAME             "Tự động đổ&i tên"
IDC_EXTRGENERALMISC            "Hỗn hợp"
IDC_EXTRKEEPBROKEN             "Giữ lại các tậ&p tin bị hỏng"
IDC_EXTREXPLORER               "Hiển thị các tập tin trong E&xplorer"
IDC_EXTRSAVE                   "&Lưu các thiết lập"
IDC_GETPATHDISPLAY             "&Hiển thị"
IDC_GETPATHNEWFOLDER           "Thư mục &mới"


:DIALOG GETEXTRPATHADV

SIZE                           "100*100"
CAPTION                        "Nâng cao"
IDC_EXTRFILETIME               "Thời gian tập tin"
IDC_EXTRMTIME                  "Đặt thời gian &chỉnh sửa"
IDC_EXTRCTIME                  "Đặt thời gian &tạo thành"
IDC_EXTRATIME                  "Đặt thời gian t&ruy cập cuối cùng"
IDC_EXTRATTRIBUTES             "Thuộc tính"
IDC_EXTRCLEARARC               "&Xóa thuộc tính \"Tập tin nén\""
IDC_EXTRSECURITY               "Đặt &bảo mật tập tin"
IDC_EXTRSETCOMPRESSED          "Đặt t&huộc tính \"Nén\""
IDC_EXTRFILEPATHS              "Đường dẫn tập tin"
IDC_EXTRRELPATHS               "Giải nén các đường dẫn tươn&g đối"
IDC_EXTRFULLPATHS              "Giải nén các đường dẫn đầ&y đủ"
IDC_IGNOREPATHS                "Không giải nén các đường &dẫn"
IDC_EXTRABSPATHS               "Giải nén các đường dẫn t&uyệt đối"
IDC_EXTRDELETEARCHIVE          "Xóa tập tin nén"
IDC_EXTRDELNEVER               "&Không bao giờ"
IDC_EXTRDELASK                 "Yêu cầu xác &nhận"
IDC_EXTRDELALWAYS              "&Luôn luôn"
IDC_EXTRDELRECYCLEBIN          "&Di chuyển vào thùng rác"
IDC_EXTRADVANCEDMISC           "Hỗn hợp"
IDC_EXTRBACKGROUND             "G&iải nén trong nền"
IDC_EXTRWAITOTHERS             "Chờ nếu các bản &sao WinRAR khác đang hoạt động"
IDC_EXTRABSLINKS               "Cho &phép các đường dẫn tuyệt đối trong các liên kết tượng trưng"
IDC_EXTRALLOWINCOMPAT          "Ch&o phép các tên có khả năng không tương thích"


:DIALOG GETEXTRPATHOPT

SIZE                           "100*100"
CAPTION                        "Tùy chọn"
IDC_EXTRALTPATH                "Giải nén vào"
IDC_EXTRALTPATHDEST            "Đường &dẫn đích"
IDC_EXTRALTPATHDESTDIR         "Các thư mục &con trong đường dẫn đích"
IDC_EXTRALTPATHARCDIR          "Thư mục con trong &thư mục lưu trữ"
IDC_EXTRALTPATHARC             "&Lưu trữ tệp"
IDC_EXTRPOWERMODETITLE         "&Khi hoàn thành"
IDC_EXTRCMDSWITCHESTITLE       "Công tắc &bổ sung"


:DIALOG ABOUTRARDLG

SIZE                           "100*100"
CAPTION                        "Giới thiệu WinRAR"
IDC_ABOUTVERSION               "WinRAR"
IDC_ABOUTCOPYRIGHT             "Bản quyền © 1993-%d bởi"
IDC_ABOUTAUTHOR                "Alexander Roshal"
IDC_ABOUTPUBLISHER             "Phân phối bởi win.rar GmbH"
IDC_ABOUTTRANSLATED            "Phiên bản Tiếng Việt\nDịch bởi Phan Quốc Văn"
IDC_ABOUTREGISTERED            "40 ngày thử nghiệm"
IDOK                           "Đồng ý"
IDC_ABOUTLICENSE               "&Giấy phép"
IDC_ABOUTACKNOWLEDGMENTS       "&Chứng thực"
IDC_ABOUTHOME                  "&Trang Chủ"


:DIALOG CMDWNDADD

SIZE                           "100*100"
CAPTION                        "Chuẩn bị các tập tin ..."
IDC_CMDELAPSEDTITLE            "Thời gian đã qua"
IDC_CMDTIMELEFTTITLE           "Thời gian còn lại"
IDC_CMDCOMPRESSIONRATIOTITLE   "Tỷ lệ nén"
IDC_CMDPROCESSEDTITLE          "Đã xử lý"
IDC_CMDBACKGROUND              "&Nền"
IDC_CMDPAUSE                   "Tạm &dừng"
IDCANCEL                       "Hủy"
IDC_CMDMODE                    "&Chế độ..."
IDHELP                         "Trợ giúp"


:DIALOG CMDWNDOTHER

SIZE                           "100*100"
IDC_CMDBACKGROUND              "&Nền"
IDC_CMDPAUSE                   "Tạm &dừng"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG CMDWNDREAD

SIZE                           "100*100"
CAPTION                        "Đọc lưu trữ nội dung"
IDC_CMDELAPSEDTITLE            "Thời gian trôi qua"
IDC_CMDTIMELEFTTITLE           "Thời gian còn lại"
IDC_CMDBACKGROUND              "&Nền"
IDC_CMDPAUSE                   "Tạm &dừng"
IDCANCEL                       "Hủy"


:DIALOG REPLACEFILEDLG

SIZE                           "100*100"
CAPTION                        "Xác nhận thay thế"
IDC_OWRFILEEXISTS              "Tập tin sau đã tồn tại"
IDC_OWRASKREPLACE              "Bạn có muốn thay thế tập tin đã có"
IDC_OWRQUESTION                "bằng cái này?"
IDC_OWRYES                     "&Có"
IDC_OWRALL                     "Có &Tất cả"
IDC_OWRRENAME                  "Đổi tê&n"
IDC_OWRAUTORENAME              "Đổ&i tên Tất cả"
IDC_OWRNO                      "&Không"
IDC_OWRNOALL                   "Khôn&g Tất cả"
IDC_OWRCANCEL                  "&Hủy"
IDHELP                         "Trợ &giúp"


:DIALOG RENAMEDLG

SIZE                           "100*100"
CAPTION                        "Đổi tên"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDC_RENAMEFROM                 "Đổi tên tập tin mới"
IDC_RENAMETO                   "thành"


:DIALOG ERRORLISTDLG

SIZE                           "100*100"
CAPTION                        "Winrar: Tin nhắn chẩn đoán"
IDOK                           "&Thoát"
IDC_ERRORBREAK                 "&Ngắt thao tác"
IDC_ERRCOPYTOCLIPBOARD         "Sao chép vào &clipboard"


:DIALOG SELECTDLG

SIZE                           "100*100"
CAPTION                        "Lựa chọn"
IDC_SELECTMASKTITLE            "&Nhập mặt nạ tập tin"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"


:DIALOG UNSELECTDLG

SIZE                           "100*100"
CAPTION                        "Bỏ chọn"
IDC_SELECTMASKTITLE            "&Nhập mặt nạ tệp"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"


:DIALOG INFO

SIZE                           "100*100"
CAPTION                        "Thông tin"
IDC_INFOEXTRVERSIONTEXT        "Phiên bản để giải nén"
IDC_INFOOSTEXT                 "HĐH Chủ"
IDC_INFOFOLDERSTEXT            "Tổng tập tin"
IDC_INFOFILESTEXT              "Tổng tập tin"
IDC_INFOTOTALLENGTHTEXT        "Tổng kích thước"
IDC_INFOPACKEDLENGTHTEXT       "Kích thước đã nén"
IDC_INFORATIOTEXT              "Tỷ lệ"
IDC_INFOSFXTEXT                "Kích thước module SFX"
IDC_INFOMAINCOMMENTTEXT        "Chú thích chính"
IDC_INFOPASSWORDSTEXT          "Mật khẩu"
IDC_INFODICTTEXT               "Kích thước từ điển"
IDC_INFORECTEXT                "Bản ghi phục hồi"
IDC_INFOLOCKTEXT               "Khóa tập tin nén"
IDC_INFOORIGNAMETEXT           "Tên gốc"
IDC_INFOORIGTIMETEXT           "Thời gian gốc"


:DIALOG INFOFILE

SIZE                           "100*100"
CAPTION                        "Thông tin"
IDC_INFOFILESTATISTICS         "Thống kê tập tin"
IDC_INFOFILESTATUSTEXT         "Tình trạng"
IDC_INFOFILESTATUS             "Đang quét"
IDC_INFOFILENUMBERTEXT         "Tập tin"
IDC_INFOFILENUMBER             "0"
IDC_INFOFOLDERNUMBERTEXT       "Thư mục"
IDC_INFOFOLDERNUMBER           "0"
IDC_INFOARCHIVENUMBERTEXT      "Tập tin nén"
IDC_INFOARCHIVENUMBER          "0"
IDC_INFOFILESIZETEXT           "Tổng kích thước"
IDC_INFOFILESIZE               "0"
IDC_INFOCLUSTERSIZETEXT        "Kích thước cluster"
IDC_INFOREALFILESIZETEXT       "Kích thước tập tin thực"
IDC_INFOFILESLACKTEXT          "Phần trống tập tin"
IDC_INFOESTBOX                 "Dự đoán Nén"
IDC_INFOESTIMATE               "Ước &lượng"
IDC_INFOESTSTATUSTEXT          "Tình trạng"
IDC_INFOESTSTATUS              "Nhàn rỗi"
IDC_INFOESTRATIOTEXT           "Tỷ lệ"
IDC_INFOESTPACKSIZETEXT        "Kích thước đã nén"
IDC_INFOESTPACKTIMETEXT        "Thời gian ước lượng"
IDC_INFOESTAUTOSTART           "Bắt đầu &tự động"


:DIALOG INFOOPT

SIZE                           "100*100"
CAPTION                        "Tùy chọn"
IDC_INFOOPTPROTECTARCHIVE      "Bảo vệ tập tin nén"
IDC_INFOOPTSETRRSIZE           "Đặt kích thước &bản ghi phục hồi đến"
IDC_INFOOPTRRPERCENTTEXT       "phần trăm của kích thước tập tin nén"
IDC_INFOOPTCREATEREV           "Tạo các phần phục hồi"
IDC_INFOOPTRECVOLUMESTEXT      "phần &phục hồi"
IDC_INFOOPTLOCKTEXT            "Khóa tập tin nén"
IDC_INFOOPTLOCK                "Vô hiệu sự &chỉnh sửa tập tin nén"
IDC_INFOOPTORIGARC             "Tên gốc của tập tin"
IDC_INFOOPTORIGCOPY            "&Sao chép vào clipboard"


:DIALOG INFOCMT

SIZE                           "100*100"
CAPTION                        "Bình luận"
IDC_INFOCOMMENTTITLE           "&Chú thích tập tin nén"
IDC_INFOCOMMENTFINDFILE        "Nạp chú thích từ &tập tin"


:DIALOG INFOSFX

SIZE                           "100*100"
CAPTION                        "SFX"
IDC_INFOSFXCMDBOX              "Chọn lệnh"
IDC_INFOSFXKEEP                "&Không đổi module SFX"
IDC_INFOSFXADD                 "&Thêm một module SFX mới"
IDC_INFOSFXREMOVE              "&Loại bỏ module đã có khỏi tập tin nén"
IDC_INFOSFXLISTTITLE           "Chọn &module SFX"
IDC_INFOSFXADVANCED            "Các tùy chọn SFX &Nâng cao..."


:DIALOG SFXOPTGENERAL

SIZE                           "100*100"
CAPTION                        "Chung"
IDC_SFXPATHTITLE               "Đường dẫn để giải nén"
IDC_SFXPATHPROGFILES           "Tạo trong \"&Program Files\""
IDC_SFXPATHCURDIR              "Tạo trong thư mục &hiện tại"
IDC_SFXPATHABSOLUTE            "Đường dẫn &tuyệt đối"
IDC_SFXSAVEPATH                "&Lưu và phục hồi các đường dẫn"
IDC_SFXSAVEASDEFAULT           "Lưu &các thiết lập hiện tại thành mặc định"


:DIALOG SFXOPTSETUP

SIZE                           "100*100"
CAPTION                        "Cài đặt"
IDC_SFXSETUPPROGRAM            "Chương trình cài đặt "
IDC_SFXSETUPTITLE              "Chạy &sau khi giải nén"
IDC_SFXPRESETUPTITLE           "Chạy t&rước khi giải nén"
IDC_SFXSETUPCODE               "&Chờ và trả về mã thoát"
IDC_SFXSETUPCODEADJUSTTEXT     "Điều chỉnh mã &thoát"


:DIALOG SFXOPTADVANCED

SIZE                           "100*100"
CAPTION                        "Nâng cao"
IDC_SFXDELETEBOX               "Xóa"
IDC_SFXDELETETITLE             "Các tập tin để &xóa trong thư mục đích"
IDC_SFXSHORTCUTSBOX            "Shortcut"
IDC_SFXSHORTCUTSADD            "&Thêm shortcut..."
IDC_SFXREQUIREADMINSTRATOR     "&Yêu cầu quyền truy cập quản trị"


:DIALOG SFXADDSHORTCUT

SIZE                           "100*100"
CAPTION                        "Thêm lối tắt"
IDC_SHORTCUTWHERE              "Nơi để tạo"
IDC_SHORTCUTDESKTOP            "Màn &hình"
IDC_SHORTCUTPROGRAMS           "Trình đơn Start/&Programs"
IDC_SHORTCUTSTARTUP            "S&tartup"
IDC_SHORTCUTPARAM              "Tham số shortcut"
IDC_SHORTCUTSRCNAMETITLE       "Tên tập tin &nguồn"
IDC_SHORTCUTDESTFOLDERTITLE    "Thư mụ&c đích"
IDC_SHORTCUTDESCRIPTIONTITLE   "&Mô tả shortcut"
IDC_SHORTCUTLINKNAMETITLE      "Tên sh&ortcut"
IDC_SHORTCUTICONTITLE          "&Biểu tượng shortcut"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG SFXOPTMODES

SIZE                           
CAPTION                        
IDC_SFXTEMPMODEBOX             "Chế độ tạm thời"
IDC_SFXTEMPMODE                "Giải nén vào thư mục &tạm"
IDC_SFXTEMPMODEQUESTIONTITLE   "&Câu hỏi tùy chọn"
IDC_SFXTEMPMODETITLETITLE      "Tiê&u đề câu hỏi"
IDC_SFXTEMPMODESETUSER         "Hạn chế &quyền truy cập thư mục"
IDC_SFXSILENTMODE              "Chế độ im lặng"
IDC_SFXSILENTNONE              "&Hiển thị tất cả"
IDC_SFXSILENTSKIPSTART         "Ẩn hộp thoại &bắt đầu"
IDC_SFXSILENTALL               "Ẩ&n tất cả"


:DIALOG SFXOPTUPDATE

SIZE                           "100*100"
CAPTION                        "Cập nhật"
IDC_SFXUPDATEMODE              "Chế độ cập nhật"
IDC_SFXUPDATENORMAL            "Giải nén và tha&y thế các tập tin"
IDC_SFXUPDATEUPDATE            "Giải nén và &cập nhật các tập tin"
IDC_SFXUPDATEFRESH             "Chỉ làm mới các &tập tin đã có"
IDC_SFXOVERWRITEMODE           "Chế độ ghi đè"
IDC_SFXOVERWRITEASK            "Hỏi trước &khi ghi đè"
IDC_SFXOVERWRITEALL            "&Ghi đè tất cả các tập tin"
IDC_SFXOVERWRITESKIP           "&Bỏ qua các tập tin đã có"


:DIALOG SFXOPTTEXT

SIZE                           "100*100"
CAPTION                        "Văn bản"
IDC_SFXTITLETITLE              "&Tiêu đề của cửa sổ SFX"
IDC_SFXTEXTTITLE               "&Văn bản để hiển thị trong cửa sổ SFX"
IDC_SFXTEXTBROWSE              "&Nạp văn bản từ tập tin..."
IDC_SFXDONETITLETITLE          "Tiêu đề tin &nhắn hoàn thành"
IDC_SFXDONETEXTTITLE           "&Hoàn thành văn bản tin nhắn"


:DIALOG SFXOPTLOGO

SIZE                           "100*100"
CAPTION                        "Logo và biểu tượng"
IDC_SFXLOGONAMETITLE           "Tùy biến logo và biểu tượng SFX"
IDC_SFXLOGOBROWSE              "&Duyệt..."
IDC_SFXHILOGONAMETITLE         "Nạp lo&go SFX từ tập tin"
IDC_SFXHILOGOBROWSE            "&Duyệt..."
IDC_SFXICONNAMETITLE           "Nạp &biểu tượng SFX từ tập tin"
IDC_SFXICONBROWSE              "D&uyệt..."


:DIALOG SFXOPTLICENSE

SIZE                           "100*100"
CAPTION                        "Giấy phép"
IDC_SFXLICENSETITLETITLE       "&Tiêu đề của cửa sổ giấy phép"
IDC_SFXLICENSETEXTTITLE        "&Văn bản giấy phép"
IDC_SFXLICENSETEXTBROWSE       "&Nạp văn bản từ tập tin..."


:DIALOG FAVORITESDLG

SIZE                           "100*100"
CAPTION                        "Thêm yêu thích"
IDC_FAVORITEEDITTITLE          "&Thêm mục sau vào ưa thích"
IDC_FAVORITEARCDIRTITLE        "Thư mục &con tập tin nén"
IDC_FAVORITEDESCTITLE          "&Mô tả (tùy chọn)"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG ORGFAVORITESDLG

SIZE                           "100*100"
CAPTION                        "Sắp xếp yêu thích"
IDC_ORGADD                     "&Thêm"
IDC_ORGDELETE                  "&Xóa"
IDC_ORGEDIT                    "&Chỉnh sửa"
IDC_ORGUP                      "&Lên"
IDC_ORGDOWN                    "X&uống"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG CONFIGINTERFACE

SIZE                           "100*100"
CAPTION                        "Giao diện"
IDC_CONFIGCOLORMODE            "Chế độ màu"
IDC_CONFIGCOLORMODEAUTO        "Hệ thống"
IDC_CONFIGCOLORMODELIGHT       "Sáng"
IDC_CONFIGCOLORMODEDARK        "Tối"
IDC_CONFIGHISTORY              "Lịch sử"
IDC_CONFIGARCHISTORY           "Giữ lịch &sử tập tin nén"
IDC_CONFIGDIALOGSHISTORY       "Cho phép lịch sử trong các &hộp thoại"
IDC_CONFIGTOOLBARBOX           "Thanh công cụ"
IDC_CONFIGBTNTEXT              "Hiển thị côn&g cụ"
IDC_CONFIGLOCKTOOLBARS         "&Khóa thanh công cụ"
IDC_CONFIGTOOLBARS             "Thanh &công cụ..."
IDC_CONFIGBUTTONS              "Cô&ng cụ..."
IDC_CONFIGMISC                 "Linh tinh"
IDC_CONFIGWIZARD               "Kích hoạt T&rình thuật sĩ khi bắt đầu"
IDC_CONFIGSOUND                "Cho phép â&m thanh"
IDC_CONFIGCOMMENT              "H&iển thị chú thích tập tin nén"
IDC_CONFIGCOMMENTWRAP          "&Xuống dòng trong chú thích"
IDC_CONFIGREUSE                "Sử &dụng lại cửa sổ hiện có"
IDC_CONFIGWINTOP               "L&uôn trên cùng"
IDC_CONFIGFULLPATHSTITLE       "Đường dẫn đầy đủ trong &tiêu đề"
IDC_CONFIGSYSTEMPROGRESS       "Thanh tiến trình &windows"
IDC_CONFIGTASKBARPROGRESS      "Th&anh tiến trình thanh tác vụ"


:DIALOG CONFIGSYSTEM

SIZE                           "100*100"
CAPTION                        "Hệ thống"
IDC_CONFIGPERFORMANCE          "Hiệu suất"
IDC_CONFIGPRIORLOW             "&Quyền ưu tiên thấp"

; Title must be before edit for hotkey to work and "updown" must be after edit because of UDS_AUTOBUDDY.
IDC_CONFIGTHREADSTITLE         "Đa &luồng"

IDC_CONFIGLARGEPAGES           "&Trang bộ nhớ lớn"
IDC_CONFIGLOGGING              "Ghi nhận"
IDC_CONFIGLOG                  "Ghi nhận các lỗi ra tậ&p tin"
IDC_CONFIGLIMITLOGSIZE         "Giới hạn kích thước tập tin &ghi nhận ở"
IDC_CONFIGKBTEXT               "kilobyte"


:DIALOG CONFIGCOMPRESSION

SIZE                           "100*100"
CAPTION                        "Nén"
IDC_CONFIGPROFILES             "Mẫu nén"
IDC_CONFIGNEWPROFILE           "Tạo &mặc định..."
IDC_CONFIGORGPROFILES          "&Quản lý..."
IDC_CONFIGPREDEFVALUES         "Các giá trị được xác định trước"
IDC_CONFIGVOLSIZES             "Định nghĩa &kích thước phần..."
IDC_CONFIGDICTSIZES            "&Xác định kích thước từ điển..."
IDC_CONFIGDICTLIMIT            "Kích &thước tối đa được phép trích xuất"
IDC_CONFIGDICTLIMITGB          "GB"
IDC_CONFIGASARCHIVESTITLE      "&Các loại tệp để mở dưới dạng lưu trữ"


:DIALOG CONFIGPATHS

SIZE                           "100*100"
CAPTION                        "Đường dẫn"
IDC_CONFIGTEMPFILEFOLDER       "Thư mục cho các tập tin &tạm"
IDC_CONFIGTEMPBROWSE           "&Duyệt..."
IDC_CONFIGUSETEMPFORREMOVABLE  "&Chỉ sử dụng cho các ổ đĩa di động"
IDC_CONFIGSTARTFOLDERBOX       "Thư mục &khởi động"
IDC_CONFIGSTARTFOLDERBROWSE    "D&uyệt..."
IDC_CONFIGLASTSTARTFOLDER      "&Phục hồi thư mục làm việc cuối cùng khi khởi động"
IDC_CONFIGDEFARCFOLDER         "&Thư mục mặc định cho các tập tin nén"
IDC_CONFIGADDPATHBROWSE        "&Duyệt..."
IDC_CONFIGEXTRACTFOLDERBOX     "Thư mục mặc định cho các tập tin đã &giải nén"
IDC_CONFIGEXTRACTBROWSE        "D&uyệt..."
IDC_CONFIGEXTRACTAPPENDNAME    "&Nối tên tập tin nén vào đường dẫn"
IDC_CONFIGEXTRACTREMOVEREDDIR  "&Loại bỏ các thư mục thừa khỏi đường dẫn giải nén"


:DIALOG CONFIGLIST

SIZE                           "100*100"
CAPTION                        "Danh sách tệp"
IDC_CONFIGLISTTYPE             "Loại danh sách"
IDC_CONFIGLISTVIEW             "&Danh sách"
IDC_CONFIGDETAILSVIEW          "&Chi tiết"
IDC_CONFIGLISTSTYLE            "Kiểu danh sách"
IDC_CONFIGGRID                 "Hiển thị các &hàng lưới"
IDC_CONFIGFULLROW              "Chọn &toàn bộ hàng"
IDC_CONFIGCHECKBOXES           "Hộp để &kiểm tra"
IDC_CONFIGLISTSELECTION        "Sự lựa chọn"
IDC_CONFIGSINGLECLICK          "&Kích đơn để mở một mục"
IDC_CONFIGDOUBLECLICK          "Kích đú&p để mở một mục"
IDC_CONFIGNOTUNDERLINE         "Không &gạch dưới tên"
IDC_CONFIGUNDERLINECURRENT     "Gạch dưới tê&n hiện tại"
IDC_CONFIGUNDERLINEALL         "Gạch dướ&i tất cả các tên"
IDC_CONFIGLISTFILES            "Tập tin"
IDC_CONFIGARCHIVESFIRST        "Hiển thị các tập tin nén t&rước"
IDC_CONFIGCOLORNTFSATTR        "Hiển thị các tập tin NTFS đã mã hóa hoặc đã nén theo &màu"
IDC_CONFIGALLVOLUMES           "Gộp nội d&ung các phần"
IDC_CONFIGSHOWSECONDS          "Hiển thị giâ&y"
IDC_CONFIGEXACTSIZES           "Kích thước đún&g"
IDC_CONFIGLISTCOLUMNS          "Cộ&t…"
IDC_CONFIGLISTFONT             "Chọn &font..."


:DIALOG CONFIGVIEWER

SIZE                           "100*100"
CAPTION                        "Trình xem"
IDC_CONFIGVIEWERTYPE           "Loại trình xem"
IDC_CONFIGVIEWERINTERNAL       "Trình xem &bên trong"
IDC_CONFIGVIEWEREXTERNAL       "Trình xem bên &ngoài"
IDC_CONFIGVIEWERASSOCIATED     "&Chương trình đã liên kết"
IDC_CONFIGVIEWERASK            "&Yêu cầu"
IDC_CONFIGINTERNALVIEWER       "Trình xem bên trong"
IDC_CONFIGVIEWERAUTODETECT     "Sử dụng mã hóa D&OS"
IDC_CONFIGREUSEWINDOW          "&Sử dụng lại cửa sổ hiện hữu"
IDC_CONFIGVIEWERWRAP           "C&uộn dòng"
IDC_CONFIGVIEWERUNPALLTITLE    "&Giải nén mọi thứ cho"
IDC_CONFIGIGNOREMODTITLE       "Bỏ &qua các sửa đổi với"
IDC_CONFIGEXTVIEWERTITLE       "Tên trình &xem bên ngoài"
IDC_CONFIGVIEWERBROWSE         "&Duyệt..."


:DIALOG CONFIGSECURITY

SIZE                           "100*100"
CAPTION                        "Bảo vệ"
IDC_CONFIGPROHIBITEDTYPES      "Loại tập tin bị cấm"
IDC_CONFIGEXCLEXTR             "&Loại tập tin để loại trừ khỏi việc giải nén"
IDC_CONFIGMARKOFWEB            "Tuyên truyền nhãn hiệu của Web"
IDC_CONFIGMARKOFWEBZONEONLY    "Chỉ có &giá trị vùng"
IDC_CONFIGWIPETEMPFILES        "Xóa sạch các tập tin tạm"
IDC_CONFIGWIPETEMPNEVER        "&Không bao giờ"
IDC_CONFIGWIPETEMPALWAYS       "L&uôn luôn"
IDC_CONFIGWIPETEMPENCRYPTED    "&Chỉ đã mã hóa"
IDC_CONFIGSECURITYMISC         "Hỗn hợp"
IDC_CONFIGPROPOSESCANNER       "Yêu cầu để chọn trình quét &virut"


:DIALOG CONFIGINTEGRATION

SIZE                           "100*100"
CAPTION                        "Tích hợp"
IDC_ASSOCWITH                  "Liên kết WinRAR với"
IDC_ASSOCRAR                   "&RAR"
IDC_ASSOCZIP                   "&ZIP"
IDC_ASSOC7Z                    "7-Zip"
IDC_ASSOCARJ                   "ARJ"
IDC_ASSOCBZ2                   "BZ2"
IDC_ASSOCCAB                   "CAB"
IDC_ASSOCGZ                    "GZip"
IDC_ASSOCISO                   "ISO"
IDC_ASSOCJAR                   "JAR"
IDC_ASSOCLZ                    "LZ"
IDC_ASSOCLZH                   "LZH"
IDC_ASSOCTAR                   "TAR"
IDC_ASSOCUUE                   "UUE"
IDC_ASSOCXZ                    "XZ"
IDC_ASSOCZ                     "Z"
IDC_ASSOCZIPX                  "ZIPX"
IDC_ASSOCZST                   "ZST"
IDC_ASSOC001                   "001"
IDC_ASSOCALL                   "Chọn/Bỏ chọn &tất cả"
IDC_USERDEFINEDEXT             "&Người dùng tự định nghĩa"
IDC_INTEGRATIONINTERFACE       "Giao diện"
IDC_LINKDESKTOP                "Thêm WinRAR vào &Màn hình"
IDC_LINKSTARTMENU              "Thêm WinRAR vào &Start"
IDC_LINKPROGRAMS               "Tạo &nhóm chương trình WinRAR"
IDC_SHELLINTEGRATION           "Tích hợp shell"
IDC_SHELLEXT                   "Tích &hợp WinRAR vào shell"
IDC_SHELLCASCADED              "Trình đơn chồng nha&u"
IDC_SHELLICONS                 "&Biểu tượng trong trình đơn"
IDC_SHELLLEGACYMENU            "Trình đơn &kế thừa"
IDC_SETCONTEXTMENU             "Các mục trình đơn n&gữ cảnh..."


:DIALOG FILELISTCOLUMNS

SIZE                           "100*100"
CAPTION                        "Chọn các cột danh sách tệp"
IDC_FLCOLOUTSIDE               "Bên ngoài kho lưu trữ"
IDC_FLCOLFNAME                 "Họ"
IDC_FLCOLFSIZE                 "Cắt"
IDC_FLCOLFPACKED               "Nén"
IDC_FLCOLFTYPE                 "Kiểu"
IDC_FLCOLFMODIFIED             "Sửa đổi"
IDC_FLCOLFCREATED              "Tạo"
IDC_FLCOLFACCESSED             "Đã xem"
IDC_FLCOLFATTR                 "Thuộc tính"
IDC_FLCOLFCHECKSUM             "Checksum"
IDC_FLCOLFPATH                 "Đường dẫn trong chế độ xem phẳng"
IDC_FLCOLINSIDE                "Bên trong kho lưu trữ"
IDC_FLCOLANAME                 "Họ"
IDC_FLCOLASIZE                 "Cắt"
IDC_FLCOLAPACKED               "Nén"
IDC_FLCOLATYPE                 "Kiểu"
IDC_FLCOLAMODIFIED             "Sửa đổi"
IDC_FLCOLACREATED              "Tạo"
IDC_FLCOLAACCESSED             "Đã xem"
IDC_FLCOLAATTR                 "Thuộc tính"
IDC_FLCOLACHECKSUM             "Checksum"
IDC_FLCOLAPATH                 "Đường dẫn trong chế độ xem phẳng"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDC_FLCOLDEFAULT               "&Mặc định"


:DIALOG SELECTVIEWERDLG

SIZE                           "100*100"
CAPTION                        "Chọn Loại Trình xem"
IDC_SELECTVIEWERINT            "Trình xem &bên trong"
IDC_SELECTVIEWEREXT            "Trình xem bên &ngoài"
IDC_SELECTVIEWERASSOC          "&Chương trình đã liên kết"
IDCANCEL                       


:DIALOG CREATEVOLDLG

SIZE                           "100*100"
CAPTION                        "Phần tiếp theo"
IDC_CREATEVOLNAMETITLE         "Tên &phần"
IDC_CREATEVOLBROWSE            "&Duyệt"
IDC_CREATEVOLSIZETITLE         "&Kích thước phần (bỏ trống để tự động phát hiện)"
IDC_CREATEVOLINFO1             "WinRAR đã sẵn sàng để tạo phần tiếp theo. Bây giờ bạn có thể thay thế ổ đĩa đích, chỉnh sửa tên hay kích thước phần, nếu cần thiết."
IDC_CREATEVOLINFO2             "Bạn có muốn tạo phần tiếp theo?"
IDC_CREATEVOLYES               "&Tạo"
IDC_CREATEVOLALL               "Tạo Tất &cả"
IDCANCEL                       "&Hủy"


:DIALOG REMINDER

SIZE                           "100*100"
CAPTION                        "Vui lòng mua giấy phép Winrar"
IDC_REMINDERONLINE             "Mua t&rực tuyến"
IDC_REMINDERPRICE              "Làm thế nào để &mua"
IDOK                           "Đóng"
IDHELP                         "&Trợ giúp"
IDC_REMINDERINFO               "WinRAR không phải là phần mềm miễn phí. Sau 40 ngày thử nghiệm phải mua giấy phép hoặc gỡ nó ra khỏi máy tính của bạn."


:DIALOG ORGPROFILES

SIZE                           "100*100"
CAPTION                        "Tổ chức hồ sơ"
IDC_ORGPROFLISTTITLE           "Các &mẫu hiện tại"
IDC_ORGPROFEDIT                "&Chỉnh sửa"
IDC_ORGPROFDELETE              "&Xóa"
IDC_ORGPROFUP                  "&Lên"
IDC_ORGPROFDOWN                "X&uống"
IDOK                           "Đóng"
IDHELP                         "Trợ giúp"


:DIALOG NEWPROFILE

SIZE                           "100*100"
CAPTION                        "Tham số hồ sơ"
IDC_PROFNAMETITLE              "Tên &mẫu"
IDC_PROFSAVEARCNAME            "Lưu tên &tập tin nén"
IDC_PROFSAVESELNAMES           "Lưu các tên tập tin đã &chọn"
IDC_PROFSETDEFAULT             "Đặt mẫu &làm mặc định"
IDC_PROFIMMEXEC                "Thực &hiện tức thời"
IDC_PROFDESKTOP                "Tạo &shortcut trên Màn hình"
IDC_PROFADDTOCONTEXTMENU       "Thêm &vào trình đơn ngữ cảnh"
IDC_PROFNEWOPTIONS             "Tùy chọn"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG ASKNEXTVOL

SIZE                           "100*100"
CAPTION                        "Khối lượng tiếp theo là bắt buộc"
IDC_NEXTVOLINFO1               "Bạn cần có phần sau để tiếp tục giải nén:"
IDC_NEXTVOLFIND                "&Duyệt..."
IDC_NEXTVOLINFO2               "Chèn một đĩa với phần này và ấn \"Đồng ý\" để thử lại hoặc ấn \"Hủy\" để ngắt sự giải nén"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG REPAIRARC

SIZE                           "100*100"
CAPTION                        "Sửa chữa"
IDC_REPAIRPATHTITLE            "&Thư mục lưu tập tin đã sửa"
IDC_REPAIRPATHFIND             "&Duyệt"
IDC_REPAIRARCTYPE              "Loại tập tin nén"
IDC_REPAIRTYPERAR              "Xem tập tin nén hỏng là dạng &RAR"
IDC_REPAIRTYPEZIP              "Xem tập tin nén hỏng là dạng &ZIP"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG ASKPROCESSVOLDLG

SIZE                           "100*100"
CAPTION                        "Phần đang xử lý"
IDC_PROCESSVOLUMENAMETITLE     "Phần hiện tại"
IDC_PROCESSALLVOLUMES          "Xử lý &Tất cả các tập tin trong tất cả các phần từ thư mục hiện tại"
IDC_PROCESSSELECTEDFILES       "Xử lý &chỉ các tập tin Đã chọn"
IDCANCEL                       "Hủy"


:DIALOG TOOLBARBUTTONS

SIZE                           "100*100"
CAPTION                        "Chọn nút thanh công cụ"
IDC_SELTBOUTARC                "Hiển thị bên ngoài"
IDC_SELTBOUP                   "&Tăng"
IDC_SELTBODOWN                 "&Giảm"
IDC_SELTBOSEP                  "Dấu phân cách"
IDC_SELTBINARC                 "Hiển thị bên trong"
IDC_SELTBIUP                   "&Lên"
IDC_SELTBIDOWN                 "X&uống"
IDC_SELTBISEP                  "Dấu phân cách"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDC_SELTBDEFAULT               "&Mặc định"
IDHELP                         "Trợ giúp"


:DIALOG SELECTTOOLBARS

SIZE                           "100*100"
CAPTION                        "Chọn thanh công cụ"
IDC_SELTOOLBARS                "Thanh công cụ"
IDC_SELTOOLBARMAIN             "Hiển thị thanh công cụ &chính"
IDC_SELTOOLBARSMALL            "Hiển t&hị nút \"Lên một mức\""
IDC_SELTOOLBARADDRESS          "Hiển &thanh địa chỉ"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"


:DIALOG WIZARDCMD

SIZE                           "100*100"
CAPTION                        "Wizard: Chọn thao tác"
IDC_WIZCMDINFO                 "Hãy chọn thao tác bạn muốn làm và ấn nút \"Tiếp\".\nChẳng hạn, nếu bạn cần giải nén nội dung của tập tin nén RAR, ZIP hay tập tin nén khác, hãy chọn \"Giải nén một tập tin nén\"."
IDC_WIZUNPACK                  "&Giải nén một tập tin nén"
IDC_WIZCREATE                  "&Tạo một tập tin nén mới"
IDC_WIZADD                     "Thêm &các tập tin vào tập tin nén đã có"


:DIALOG WIZARDARC

SIZE                           "100*100"
CAPTION                        "Wizard: Chọn kho lưu trữ"
IDC_WIZARCNAMETITLE            "&Tên"
IDC_WIZARCNAMEBROWSE           "&Duyệt..."


:DIALOG WIZARDEXTR

SIZE                           "100*100"
CAPTION                        "Wizard: Chọn một thư mục cho các tệp chưa đóng gói"
IDC_WIZEXTRINFO                "Hãy chọn một thư mục để đặt các tập tin đã giải nén và ấn \"Kết thúc\". Bạn có thể sử dụng thư mục được gợi ý hoặc ấn \"Duyệt\" để chọn một cái khác."
IDC_WIZDESTFOLDERTITLE         "&Thư mục đích để lưu các tập tin đã giải nén"
IDC_WIZDESTFOLDERBROWSE        "&Duyệt..."


:DIALOG WIZARDADDOPT

SIZE                           "100*100"
CAPTION                        "Wizard: Tùy chọn lưu trữ"
IDC_WIZADDINFO                 "Ở đây bạn có thể đặt một số tùy chọn nén bổ sung. Ấn \"Kết thúc\" khi hoàn tất."
IDC_WIZFAST                    "&Nhanh hơn, nhưng nén ít chặt hơn"
IDC_WIZMOVE                    "&Xóa các tập tin sau khi nén"
IDC_WIZSFX                     "&Tạo tập tin nén (.exe) tự-giải nén"
IDC_WIZPASSWORD                "Đặt &mật khẩu..."
IDC_WIZVOLSIZETITLE            "Nếu bạn muốn &chia tập tin nén thành các phần, nhập kích thước của một phần riêng lẻ trong trường ở dưới:"


:DIALOG PACKDETAILS

SIZE                           "100*100"
CAPTION                        "Các tham số nén nâng cao"
IDC_LONGRANGESEARCH            "Tìm kiếm tầm xa"
IDC_LONGRANGEAUTO              "Tự động"
IDC_LONGRANGEON                "Mạnh"
IDC_LONGRANGEOFF               "Vô hiệu hóa"
IDC_DELTACOMPRESSION           "Nén Delta"
IDC_DELTAAUTO                  "Áp dụng nén delta"
IDC_DELTAON                    "Luôn luôn trên"
IDC_DELTAOFF                   "Vô hiệu hóa"
IDC_EXECOMPRESSION             "Nén thực thi"
IDC_EXEAUTO                    "Áp dụng nén tập tin thực thi (Pentium) 32-bit"
IDC_EXEON                      "Luôn luôn trên"
IDC_EXEOFF                     "Vô hiệu hóa"
IDC_EXHAUSTIVESEARCH           "Tìm kiếm đầy đủ"
IDOK                           "Đồng ý"
IDC_DEFAULTPACKSETTINGS        "&Mặc định"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG CONTEXTITEMS

SIZE                           "100*100"
CAPTION                        "Trình đơn ngữ cảnh"
IDC_CONTEXTMENUITEMS           "Chọn các mục để hiển thị trong trình đơn ngữ cảnh Explorer"
IDC_CONTEXTEXTRACTTO           "&Giải nén các tập tin..."
IDC_CONTEXTEXTRACTHERE         "Giải nén Ở đâ&y"
IDC_CONTEXTEXTRACT             "Giải &nén đến <thư mục\\>"
IDC_CONTEXTEXTRACTSEPARATE     "Giải nén mỗi tập tin nén đến mỗi thư mục &riêng biệt"
IDC_CONTEXTOPENSFX             "Mở với WinRAR (cho các tập tin nén SFX)"
IDC_CONTEXTOPENARC             "Mở với WinRAR (cho các tập tin nén thông thường)"
IDC_CONTEXTADD                 "&Thêm vào tập tin nén..."
IDC_CONTEXTADDARC              "Thêm &vào <tên tập tin nén>"
IDC_CONTEXTEMAILARC            "Nén vào <tên tập tin nén> và email"
IDC_CONTEXTEMAILARCOPT         "Nén và email..."
IDC_CONTEXTTEST                "K&iểm tra tập tin nén"
IDC_CONTEXTCONVERT             "&Chuyển đổi tập tin nén..."

; Positions of IDC_CONTEXTTOP* controls are overlapping with IDC_CONTEXT*.
; WinRAR hides either one or another group depending on other options.
IDC_CONTEXTTOPEXTRACT          "&Giải nén đến <thư mục\\>"
IDC_CONTEXTTOPEXTRACTTO        "G&iải nén tập tin..."
IDC_CONTEXTTOPEXTRACTHERE      "Giải nén ở đâ&y"
IDC_CONTEXTTOPEXTRACTSEPARATE  "Giải nén mỗi file nén vào thư mục &riêng biệt"
IDC_CONTEXTTOPADDARC           "Thêm &vào <archive name>"
IDC_CONTEXTTOPADD              "&Thêm vào lưu trữ..."

IDC_CONTEXTNEWMENU             "Trình đơn \"Mới\""
IDC_CONTEXTNEWRAR              "Tập tin nén WinRAR"
IDC_CONTEXTNEWZIP              "Tập tin nén WinRAR ZIP"
IDC_CONTEXTDROPMENU            "Trình đơn ngữ cảnh kéo và thả"
IDC_CONTEXTDRAGADD             "&Hiển thị các mục nén"
IDC_CONTEXTDRAGEXTRACT         "Hiển thị các mục &giải nén"
IDC_CONTEXTSFXARCHIVES         "Nơi để kiểm tra các tập tin nén SFX"
IDC_CONTEXTSFXLOCAL            "Ổ đĩa cục &bộ"
IDC_CONTEXTSFXNETWORK          "Ổ đĩa &mạng"
IDC_CONTEXTSFXOTHER            "Ổ đĩa &khác"
IDC_CONTEXTALWAYSARCTITLE      "Luôn hiển thị các mục lưu trữ cho"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG FINDFILES

SIZE                           "100*100"
CAPTION                        "Tìm tệp"
IDC_FINDFILEWHAT               "Cái để tìm"
IDC_FINDFILENAMESTOFIND        "&Tên tập tin để tìm"
IDC_FINDFILESTRINGTOFIND       "&Chuỗi để tìm"
IDC_FINDFILEUSECASE            "&Phù hợp hoa thường"
IDC_FINDFILEALLTABLES          "Sử dụng tất cả các &bảng"
IDC_FINDFILEHEX                "Tìm hệ thập &lục phân"
IDC_FINDFILEWHERE              "Nơi để tìm"
IDC_FINDFILEAREA               "Các ổ đĩa &và thư mục"
IDC_FINDFILETYPES              "Loại tập tin &nén"
IDC_FINDFILERECURSE            "Tìm trong các thư &mục con"
IDC_FINDFILEUSUALFILES         "Tìm t&rong các tập tin"
IDC_FINDFILEARCHIVES           "Tìm tr&ong các tập tin nén"
IDC_FINDFILESKIPENCRYPTED      "Bỏ qua mã &hóa"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDC_FINDFILESAVE               "Lư&u"
IDHELP                         "Trợ giúp"


:DIALOG CMDWNDFIND

SIZE                           "100*100"
CAPTION                        "Kết quả tìm kiếm"
IDC_CMDBACKGROUND              "&Nền"
IDC_CMDPAUSE                   "&Tạm dừng"
IDCANCEL                       "&Hủy"
IDHELP                         "Trợ giúp"


:DIALOG CONVERTARC

SIZE                           "100*100"
CAPTION                        "Chuyển đổi"
IDC_CVTARCTOCONVERT            "Tập tin nén để &chuyển đổi"
IDC_CVTLISTADD                 "&Thêm..."
IDC_CVTLISTDELETE              "&Loại bỏ"
IDC_CVTARCTYPES                "L&oại tập tin nén"
IDC_CVTOPTIONS                 "Tùy chọn chuyển đổi"
IDC_CVTUSEMINRATIO             "Tỷ lệ tối thiểu được &phép"
IDC_CVTMINRATIOPERCENT         "phần trăm"
IDC_CVTCOMPRESSION             "&Nén..."
IDC_CVTDESTPATHTITLE           "Thư &mục cho các tập tin nén đã chuyển đổi"
IDC_CVTDESTPATHBROWSE          "&Duyệt..."
IDC_CVTDELETESRC               "&Xóa các tập tin nén gốc"
IDC_CVTSKIPENCRYPTED           "Bỏ &qua các tập tin nén đã mã hóa"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDC_CVTSAVE                    "Lư&u"
IDHELP                         "Trợ giúp"


:DIALOG CMDWNDCONVERT

SIZE                           "100*100"
CAPTION                        "Chuyển đổi tài liệu lưu trữ"
IDC_CMDELAPSEDTITLE            "Thời gian trôi qua"
IDC_CMDTIMELEFTTITLE           "Thời gian còn lại"
IDC_CVTRESARCHIVES             "Tập tin nén"
IDC_CVTRESFOUNDTITLE           "Tìm thấy"
IDC_CVTRESCONVERTEDTITLE       "Đã chuyển đổi"
IDC_CVTRESSIZE                 "Kích thước"
IDC_CVTRESOLDSIZETITLE         "Cũ"
IDC_CVTRESNEWSIZETITLE         "Mới"
IDC_CMDBACKGROUND              "&Nền"
IDC_CMDPAUSE                   "&Tạm dừng"
IDCANCEL                       "&Hủy"
IDHELP                         "Trợ giúp"


:DIALOG VIRSCAN

SIZE                           "100*100"
CAPTION                        "Quét virus"
IDC_VIRSCANLISTTITLE           "Trình &quét virut được tìm thấy bởi WinRAR"
IDC_VIRSCANNAMETITLE           "&Tên trình quét virut"
IDC_VIRSCANNAMEBROWSE          "&Duyệt..."
IDC_VIRSCANPARAMTITLE          "Tham số trình quét virut"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG CMDMODE

SIZE                           "100*100"
CAPTION                        "Tham số"
IDC_CMDMODECOMBOCOMPRTITLE     "&Phương pháp nén"
IDC_CMDMODEPOWERMODETITLE      "&Sau khi hoàn thành"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG REPORT

SIZE                           "100*100"
CAPTION                        "Tạo báo cáo"
IDC_REPORTFILETITLE            "&Ghi báo cáo ra tập tin"
IDC_REPORTFILEBROWSE           "&Duyệt..."
IDC_REPORTPRINT                "Gửi báo cáo đến máy &in"
IDC_REPORTCLIPBOARD            "Sao chép báo cáo vào c&lipboard"
IDC_REPORTOUTPUTFORMAT         "Định dạng xuất"
IDC_REPORTHTML                 "HT&ML"
IDC_REPORTUNICODETEXT          "Văn bản Unic&ode"
IDC_REPORTTEXT                 "&Văn bản"
IDC_REPORTSORTTITLE            "&Sắp xếp các tập tin theo"
IDC_REPORTSORTSEPARATE         "Sắp &xếp các tập tin nén riêng rẽ"
IDC_REPORTINCLUDE              "Bao gồm vào báo cáo"
IDC_REPORTARCHIVES             "&Tập tin nén"
IDC_REPORTUSUALFILES           "&Những tập tin thông thường"
IDC_REPORTARCNAME              "Tên tậ&p tin nén"
IDC_REPORTTOTAL                "Thông tin tổng &cộng"
IDC_REPORTSIZE                 "&Kích thước tập tin"
IDC_REPORTPACKEDSIZE           "Kíc&h thước đã nén"
IDC_REPORTDATE                 "Ngà&y tập tin"
IDC_REPORTCRC                  "Tổng &kiểm tra tập tin"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"
IDC_REPORTSAVE                 "Lư&u"


:DIALOG CMDWNDBENCH

SIZE                           "100*100"
CAPTION                        "Điểm chuẩn"
IDC_BENCHSYSTEMBOX             "Hệ thống"
IDC_BENCHSPEEDBOX              "Tốc độ"
IDC_BENCHRESULTSPEEDTITLE      "Kết quả, KB/s"
IDC_BENCHRESULTSPEED           "Xin hãy đợi"
IDC_BENCHSPEEDTITLE            "Hiện tại, KB/s"
IDC_BENCHSPEED                 "Xin hãy đợi"
IDC_BENCHTOTALBOX              "Tổng cộng"
IDC_CMDELAPSEDTITLE            "Thời gian trôi qua"
IDC_BENCHDATAPROCESSEDTITLE    "Xử lý, MB"
IDC_BENCHERRORSTITLE           "Lỗi tìm kiếm"
IDC_BENCHERRORS                "Không"
IDC_BENCHSMP                   "Đa &luồng"

; Title must be before edit for hotkey to work and "updown" must be after edit because of UDS_AUTOBUDDY.
IDC_BENCHTHREADSTITLE          "luồn&g"
; Edit control ignored mouse clicks here, so we use RichEdit.

IDC_CMDBACKGROUND              "&Nền"
IDC_CMDPAUSE                   "&Dừng lại"
IDC_CMDCOPYTOCLIPBOARD         "&Sao chép"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG ORGTHEMES

SIZE                           "100*100"
CAPTION                        "Sắp xếp chủ đề"
IDC_ORGTHEMESLISTTITLE         "Những &giao diện có sẵn"
IDC_ORGTHEMESARCICON           "Áp dụng cho các &biểu tượng tập tin nén"
IDC_ORGTHEMESSELECT            "&Chọn"
IDC_ORGTHEMESADD               "&Thêm"
IDC_ORGTHEMESDELETE            "&Xóa"
IDOK                           "Đồng ý"
IDHELP                         "Trợ giúp"


:DIALOG DEFVOLSIZES

SIZE                           "100*100"
CAPTION                        "Xác định kích thước"
IDC_PREDEFINEDVOLSIZES         "Kích thước được xác định trước"
IDC_DEFVOLSIZE1                "các phần 5 MB"
IDC_DEFVOLSIZE2                "các phần 100 MB"
IDC_DEFVOLSIZE3                "CD 650 MB"
IDC_DEFVOLSIZE4                "CD 700 MB"
IDC_DEFVOLSIZE5                "giới hạn FAT32 4095 MB"
IDC_DEFVOLSIZE6                "DVD+R 4482 MB"
IDC_DEFVOLSIZE7                "DVD-R 4488 MB"
IDC_DEFVOLSIZE8                "DVD+R DL 8152 MB"
IDC_DEFVOLSIZE9                "Blu-ray 23866 MB"
IDC_DEFVOLSIZE10               "Blu-ray DL 47732 MB"
IDC_USERDEFINEDVOLSIZES        "Kích thước người dùng định nghĩa"
IDC_USERDEFINEDVOLLABEL        "Nhãn"
IDC_USERDEFINEDVOLSIZE         "Kích thước, byte"
IDC_USERDEFINEDVOL1            "1."
IDC_USERDEFINEDVOL2            "2."
IDC_USERDEFINEDVOL3            "3."
IDC_USERDEFINEDVOL4            "4."
IDC_DEFVOLSIZEOTHER            "Mục khác"
IDC_DEFVOLSIZEAUTO             "chuỗi \"Tự động phát hiện\""
IDC_DEFVOLSIZEHISTORYTITLE     " mục lịch sử"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG WARNLOCKEDFILES

SIZE                           "100*100"
CAPTION                        "Cảnh báo"
IDC_WARNLOCKEDINFO1            "Các tệp này chỉ có thể được nén sau khi đóng trình chỉnh sửa tệp bên ngoài"
IDC_WARNLOCKEDINFO2            "Các thay đổi sẽ bị mất nếu bạn thoát khỏi WinRAR ngay bây giờ."
IDCANCEL                       "&Quay lại WinRAR"
IDOK                           "&Thoát"


:DIALOG READERRORDLG

SIZE                           "100*100"
CAPTION                        "Đọc lỗi"
IDC_READERRHINT                "Chọn \"Bỏ qua\" để tiếp tục với phần của tệp đã được phát, \"Bỏ qua tất cả\" để làm như vậy đối với tất cả các lỗi đọc, \"Thử lại\" để bắt đầu phát lại và \"Thoát\"để huỷ."
IDC_READERRIGNORE              "&Bỏ qua"
IDC_READERRIGNOREALL           "Bỏ qua tất cả"
IDC_READERRRETRY               "&Thử lại"
IDC_READERRQUIT                "&Thoát"


:DIALOG CLEARHISTORY

SIZE                           "100*100"
CAPTION                        "Xóa lịch sử"
IDC_CLEARHISTORYNAMES          "Xóa tên lưu trữ và mở gần đây"
IDC_CLEARHISTORYDIALOGS        "Xóa danh sách và hộp thoại thả xuống"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG POWERMANACTION

SIZE                           "100*100"
CAPTION                        "Hành động quản lý năng lượng"
IDOK                           "Thực hiện ngay lập tức"
IDCANCEL                       "Hủy"


:DIALOG LARGEDICTWARN

SIZE                           "100*100"
CAPTION                        "Cảnh báo từ điển lớn"
IDC_LARGEDICTLIMIT             "&Luôn giải nén các tập tin không vượt quá"
IDC_LARGEDICTLIMITGB           "GB"
IDOK                           "Giải nén"
IDCANCEL                       "Hủy"
IDHELP                         "Trợ giúp"


:DIALOG DEFDICTSIZES

SIZE                           "100*100"
CAPTION                        "Kích thước từ điển"
IDC_DEFDICTLISTTITLE           "Kích thước được xác định trước"
IDC_DEFDICTHISTORYTITLE        "mục lịch sử"
IDOK                           "Đồng ý"
IDCANCEL                       "Hủy"
IDC_DEFDICTDEFAULT             "&Mặc định"
IDHELP                         "Trợ giúp"


